{
  "planets_in_signs": {
    "Sun": {
      "Aries": { "title": "The Pioneer", "text": "You light matches just to see what burns. Missions start when you kick doors, not when you ask permission. People follow because you move before fear remembers its job." },
      "Taurus": { "title": "The Builder", "text": "You haul dreams into brick and steel. Patience is your war drum, consistency your quiet rebellion. Nothing you claim leaves your hands unchanged." },
      "Gemini": { "title": "The Signal", "text": "Your mind runs a dozen news feeds at once and still asks for more bandwidth. You weaponize curiosity like a scalpel. Boredom is the only thing you refuse to tolerate." },
      "Cancer": { "title": "The Hearth", "text": "You carry a shell made of intuition and barbed wire. Loyalty is your currency, and you give receipts. Anyone stepping into your orbit feels both scrutinized and protected." },
      "Leo": { "title": "The Crown", "text": "Spotlights bend to you like sunflowers. You manifest warmth and drama in the same breath. Even your silence feels choreographed." },
      "Virgo": { "title": "The Editor", "text": "You dissect chaos until it behaves. Precision is how you show love, upgrades how you apologize. The world is your draft folder." },
      "Libra": { "title": "The Arbiter", "text": "You read rooms the way others read headlines, instantly and with judgment. Harmony isn’t passive; it’s a strategy. Beauty is your favorite blunt instrument." },
      "Scorpio": { "title": "The Depth Charge", "text": "You sense motives before the sentence ends. Intensity is your resting state, transformation your hobby. People either confess or combust around you." },
      "Sagittarius": { "title": "The Voyager", "text": "You treat truth like a wildfire—dangerous but cleansing. Deadlines and borders are suggestions. Optimism is your fuel, brutal honesty your exhaust." },
      "Capricorn": { "title": "The Climber", "text": "You see hierarchies like topographical maps and plan your ascent accordingly. Ambition is your love language. Discipline lets you bend time to your will." },
      "Aquarius": { "title": "The Disruptor", "text": "You jailbreak every system you touch. Detachment keeps emotions from fogging your blueprints. Revolution is just another Tuesday." },
      "Pisces": { "title": "The Oracular", "text": "You translate feelings into myth. Boundaries blur because you’ve already merged with the collective signal. Reality takes your notes, not the other way around." }
    },
    "Moon": {
      "Aries": { "title": "Ember Heart", "text": "Your emotions hit like flash grenades—bright, loud, gone. You crave reactions more than reassurance. Peace arrives only after action." },
      "Taurus": { "title": "Stone Sanctuary", "text": "You soothe yourself with texture, ritual, and possession. Slow comfort beats dramatic breakthroughs. Anyone who disrupts your calm gets locked out." },
      "Gemini": { "title": "Whisper Network", "text": "Feelings show up as data points and gossip. You process emotions by explaining them twice. Restlessness is your emotional weather pattern." },
      "Cancer": { "title": "Tidal Soul", "text": "Your moods move like phases of the moon—predictable only if you’re paying attention. Home is your fortress and your soft spot. Loyalty is stitched into every heartbeat." },
      "Leo": { "title": "Golden Pulse", "text": "Validation is the thermostat for your feelings. You love loudly, sulk theatrically, and forgive with flair. Affection must come with spotlights." },
      "Virgo": { "title": "Quiet Analyst", "text": "You autopsy your emotions before admitting they exist. Order calms your nerves; usefulness grounds your heart. Overthinking is just quality control." },
      "Libra": { "title": "Silk Equilibrium", "text": "You negotiate with your own feelings like a diplomat. Emotional stability requires aesthetic balance. Conflict makes your stomach knot, but you’ll still curate the aftermath." },
      "Scorpio": { "title": "Secret Volcano", "text": "Your emotions smolder beneath a locked hatch. Trust is earned through x-ray honesty. Betrayal turns your heart into scorched earth." },
      "Sagittarius": { "title": "Wildfire Spirit", "text": "You feel best when there’s a horizon to chase. Emotional ruts trigger your escape velocity. Truth-telling is your form of intimacy." },
      "Capricorn": { "title": "Granite Core", "text": "Stoicism is your emotional armor. You grieve in spreadsheets and love through reliability. Vulnerability arrives only after a background check." },
      "Aquarius": { "title": "Electric Calm", "text": "You prefer logic to tears and distance to drama. Emotional clarity shows up as sudden downloads. Your heart speaks in hypotheses." },
      "Pisces": { "title": "Dream Reservoir", "text": "You absorb everyone’s feelings like it’s a side gig. Escapism is your first aid kit. Compassion floods every crack, even the undeserving ones." }
    },
    "Mercury": {
      "Aries": { "title": "The Sprinter", "text": "Thoughts hit the page before spellcheck catches up. You argue like a spark plug, firing first and editing later. Your words are impact grenades, efficient and loud." },
      "Taurus": { "title": "The Mason", "text": "You build arguments brick by brick until they can’t be toppled. Patience makes your logic sound inevitable. Silence is your favorite rhetorical pause." },
      "Gemini": { "title": "The Switchboard", "text": "Every idea gets patched into three more channels. You remix facts mid-sentence and still land the point. Conversation is a sport you always play to win." },
      "Cancer": { "title": "The Archivist", "text": "Memory and mood braid into every sentence. You speak in emotional weather reports, forecasting safety or storm. Soft words, sharp implications." },
      "Leo": { "title": "The Herald", "text": "You deliver messages like royal decrees. Dramatic emphasis is your punctuation. Confidence fills any gaps the facts can’t cover." },
      "Virgo": { "title": "The Calibrator", "text": "You diagnose flaws in arguments faster than people finish them. Precision is your comfort zone; data is your love language. Overthinking is just quality assurance." },
      "Libra": { "title": "The Diplomat", "text": "Every sentence balances fairness with style. You negotiate opinions like treaties, ensuring both sides leave impressed. Charm is your thesis statement." },
      "Scorpio": { "title": "The Interrogator", "text": "You hear lies breathing under the dialogue. Questions cut straight to the marrow. Words are blades you wield with unnerving calm." },
      "Sagittarius": { "title": "The Broadcaster", "text": "You serve truth unfiltered and at high volume. Philosophies arrive fully formed, even if you came up with them while running late. Hyperbole is just enthusiasm in your dialect." },
      "Capricorn": { "title": "The Strategist", "text": "You communicate like you’re drafting corporate bylaws. Every word has a job and a deadline. Sarcasm doubles as quality control." },
      "Aquarius": { "title": "The Frequency", "text": "Ideas download straight from the future. You talk in prototypes and proof-of-concept metaphors. Detachment keeps you objective, not cold." },
      "Pisces": { "title": "The Mystic Scribe", "text": "You narrate reality like a lucid dream. Logic bends around intuition and still lands somewhere true. People listen because you make the surreal sound sensible." }
    },
    "Venus": {
      "Aries": { "title": "Volcanic Crush", "text": "You fall fast, loud, and with a competitive streak. Love feels like a mission you must win. Boredom is the only deal-breaker." },
      "Taurus": { "title": "Devoted Collector", "text": "You romance through permanence—textures, rituals, shared assets. Loyalty is non-negotiable; indulgence is a sacred right. You curate relationships like heirlooms." },
      "Gemini": { "title": "Flirt Circuit", "text": "Your heart bond happens through wordplay and late-night tangents. You crave minds that multitask. Commitment must come with curiosity." },
      "Cancer": { "title": "Moonlit Anchor", "text": "You seduce through caretaking and emotional clairvoyance. Softness is your power move. Anyone in your orbit gets fed, warned, and fiercely defended." },
      "Leo": { "title": "Royal Heat", "text": "Love requires spectacle, loyalty, and applause. You gift affection like gold coins and expect devotion in return. Drama is just proof of passion." },
      "Virgo": { "title": "Sacred Service", "text": "You prove love by refining lives—tuning habits, fixing chaos, upgrading comfort. Perfectionism is how you protect what you treasure. Compliments must be practical." },
      "Libra": { "title": "Velvet Gravity", "text": "Aesthetic chemistry is step one, mutual admiration step two. You balance affection with precision. Harmony is the glue; elegance is the wrapping." },
      "Scorpio": { "title": "Obsidian Heart", "text": "Love is an oath signed in obsession and loyalty. You crave bonds that survive psychic x-rays. Half measures trigger your exit plan." },
      "Sagittarius": { "title": "Wild Arrow", "text": "You court with blunt truth and shared adventures. Passion thrives on wide horizons. Anyone trying to cage you becomes history fast." },
      "Capricorn": { "title": "Iron Vow", "text": "Romance is a long-term investment, not a side quest. You show affection through reliability and strategic spoiling. Trust must be earned with receipts." },
      "Aquarius": { "title": "Cosmic Ally", "text": "You love like a futurist—unconventional, idealistic, and fiercely loyal to individuality. Intellect sparks attraction, freedom keeps it alive. Emotions get decoded through shared missions." },
      "Pisces": { "title": "Tidal Devotion", "text": "You love in dissolving waves—romantic, empathic, unguarded. Soul connections are your baseline. Boundaries blur because you’d rather merge than negotiate." }
    },
    "Mars": {
      "Aries": { "title": "The Warrior", "text": "You launch before the countdown finishes. Anger is fuel, not a flaw. Victory tastes best when everyone doubted your timing." },
      "Taurus": { "title": "The Juggernaut", "text": "Once you commit, nothing short of tectonic plates will move you. Persistence is your artillery. You’d rather break obstacles than compromise." },
      "Gemini": { "title": "The Whirlwind", "text": "You fight with words, wit, and tactical chaos. Multiplicity keeps you dangerous. Standing still feels like surrender." },
      "Cancer": { "title": "The Shieldbearer", "text": "You defend your people like a tidal fortress. Emotion flips your fight switch faster than logic. Retaliation is personalized and unforgettable." },
      "Leo": { "title": "The Solar Blade", "text": "You act with theatrical conviction. Pride fuels your momentum; applause seals the win. Every move is a statement piece." },
      "Virgo": { "title": "The Surgeon", "text": "You execute with surgical precision. Efficiency is your preferred weapon. Rage gets repurposed into flawless strategy." },
      "Libra": { "title": "The Duelist", "text": "You fight for equilibrium, even if you must break a few hearts on the way. Charm masks your tactical edge. Justice is your trigger." },
      "Scorpio": { "title": "The Infiltrator", "text": "You wage war in silence and finish it with scorched earth. Intensity keeps you relentless. Enemies never see the strike until it lands." },
      "Sagittarius": { "title": "The Archer", "text": "You aim high, fire far, and refuse to retreat. Actions must align with belief or they fall apart. Restlessness keeps you in motion." },
      "Capricorn": { "title": "The Commander", "text": "You prefer long games with ironclad results. Discipline sharpens every move. Rivalries are fuel for your ascent." },
      "Aquarius": { "title": "The Rebel Engine", "text": "You act to rewrite the rules, not follow them. Detachment keeps your strategy cold and effective. Progress is your battlefield." },
      "Pisces": { "title": "The Undertow", "text": "You fight from the shadows with intuition as your compass. Energy flows in waves; when you strike, it’s a flood. Compassion doesn’t mean mercy." }
    },
    "Jupiter": {
      "Aries": { "title": "Brave Expansion", "text": "You chase luck by charging first. Risks feel like a divine dare. Opportunity shows up when you act louder than doubt." },
      "Taurus": { "title": "Steady Fortune", "text": "You grow abundance through patience and tangible value. Gratitude multiplies your resources. Stability is your chosen luxury." },
      "Gemini": { "title": "Infinite Curator", "text": "You collect perspectives like souvenirs. Curiosity opens doors others don’t notice. Conversations are your favorite passport." },
      "Cancer": { "title": "Sheltering Faith", "text": "You expand by nurturing what matters. Emotional wisdom guides every gamble. Home becomes a sanctuary for everyone you bless." },
      "Leo": { "title": "Radiant Triumph", "text": "Confidence is your magnetic field. You attract luck when you act like it’s already yours. Generosity seals the deal." },
      "Virgo": { "title": "Measured Growth", "text": "You chase mastery, not hype. Improvements stack into empires. Optimism shows up as spreadsheets and actionable faith." },
      "Libra": { "title": "Diplomatic Horizon", "text": "Partnerships unlock your fortune. You broker harmony and watch the returns compound. Grace is your growth strategy." },
      "Scorpio": { "title": "Depth Fortune", "text": "You transform crisis into opportunity. Intuition guides your high-stakes bets. Power finds you when you stop pretending you don’t want it." },
      "Sagittarius": { "title": "Cosmic Nomad", "text": "You expand by outrunning limits. Philosophy is your compass, spontaneity your vehicle. Luck keeps pace with your optimism." },
      "Capricorn": { "title": "Legacy Architect", "text": "You invest in structures that outlive you. Responsibility magnetizes power. Success is the sermon you preach by example." },
      "Aquarius": { "title": "Future Syndicate", "text": "You share knowledge like a rebellion manual. Innovation multiplies your blessings. Community is your chosen wealth." },
      "Pisces": { "title": "Mystic Tide", "text": "Faith swells your life in poetic surges. Compassion invites miracles. You surf synchronicity like it’s a skill you invented." }
    },
    "Saturn": {
      "Aries": { "title": "The Self-Made", "text": "You build discipline by repeatedly ramming the wall until it learns your name. Patience is learned, not gifted. Leadership comes with scar tissue." },
      "Taurus": { "title": "The Stabilizer", "text": "You construct patience into wealth. Security is your sacred contract. Obstacles crumble under your consistency." },
      "Gemini": { "title": "The Analyst", "text": "You systematize curiosity, turning questions into frameworks. Communication demands rigor. Every fact gets audited." },
      "Cancer": { "title": "The Guardian", "text": "You protect what’s fragile with iron boundaries. Emotional maturity is earned through responsibility. Family becomes your lifelong project." },
      "Leo": { "title": "The Regal Engineer", "text": "You architect pride into sustainable influence. Recognition must be merited. Authority feels natural once you prove loyalty to your craft." },
      "Virgo": { "title": "The Precisionist", "text": "You perfect every moving piece even when no one watches. Discipline thrives in the details. Service is your brand of mastery." },
      "Libra": { "title": "The Arbiter", "text": "You enforce fairness with courtroom logic. Relationships require contracts, not vibes. Harmony is maintained through accountability." },
      "Scorpio": { "title": "The Shadowsmith", "text": "You transmute crisis into control. Power is handled with surgical restraint. Depth isn’t optional; it’s the curriculum." },
      "Sagittarius": { "title": "The Doctrine", "text": "You codify beliefs into structures others can climb. Freedom runs on principles, not chaos. Wisdom gets published through lived proof." },
      "Capricorn": { "title": "The Mountain", "text": "You embody discipline, ambition, and long-term consequence. Legacy is your north star. Authority sticks because you outlast everyone else." },
      "Aquarius": { "title": "The Innovator", "text": "You run revolutions with spreadsheets. Structure is how you protect humanity from itself. Progress must have scaffolding." },
      "Pisces": { "title": "The Mystic Anchor", "text": "You bind spiritual insight to practical duty. Compassion wears steel-toed boots. Dreams get deadlines on your watch." }
    },
    "Uranus": {
      "Aries": { "title": "Flashpoint Rebel", "text": "You detonate change like a chain reaction. Impulse is revelation. Systems adjust or crumble when you enter the room." },
      "Taurus": { "title": "Seismic Gardener", "text": "You terraform stability using shockwaves. Innovation grows slowly but permanently. Tradition survives only after renovation." },
      "Gemini": { "title": "Quantum Messenger", "text": "You transmit ideas at lightning speed, splicing concepts mid-flight. Conversation becomes a lab experiment. Curiosity is your firmware." },
      "Cancer": { "title": "Emotional Uprising", "text": "You revolt through nurturing. Domestic life becomes a test lab for radical care. Intuition delivers disruptive downloads." },
      "Leo": { "title": "Royal Hacker", "text": "You rewrite the script by owning the stage. Creativity is your rebellion. Authenticity hits like a solar flare." },
      "Virgo": { "title": "Precision Renegade", "text": "You debug reality one flaw at a time. Revolution happens through improved efficiency. Chaos submits to your spreadsheets." },
      "Libra": { "title": "Equity Maverick", "text": "You upend social constructs with elegance. Justice gets redesigned in real time. Charm masks the radical nature of your ideas." },
      "Scorpio": { "title": "Psychic Disruptor", "text": "You hack the underworld and leak its source code. Transformation is non-negotiable. Secrets have expiration dates around you." },
      "Sagittarius": { "title": "Myth Breaker", "text": "You shatter dogma with neon flamethrowers of truth. Philosophies reboot when you touch them. Wanderlust doubles as a coup." },
      "Capricorn": { "title": "System Architect", "text": "You innovate from within, flipping hierarchies using their own rules. Tradition only survives if it evolves. Authority meets its hacker." },
      "Aquarius": { "title": "Signal Generator", "text": "You embody the blueprint for the future. Detachment keeps your perspective uncorrupted. Revolution arrives as a push notification." },
      "Pisces": { "title": "Dream Hacker", "text": "You dissolve reality’s code and rewrite it with empathy. Boundaries glitch around your presence. Inspiration behaves like a virus you engineered." }
    },
    "Neptune": {
      "Aries": { "title": "Dream Warrior", "text": "You chase visions with a sword in hand. Inspiration strikes like lightning and expects immediate action. Mysticism feels more real once you set it on fire." },
      "Taurus": { "title": "Velvet Oracle", "text": "You manifest dreams through texture, ritual, and slow devotion. Spirituality must be touchable. Fantasy gets upholstered in luxury." },
      "Gemini": { "title": "Mercurial Muse", "text": "You speak in riddles that somehow decode reality. Imagination flickers across every conversation. Truth arrives disguised as gossip." },
      "Cancer": { "title": "Moonlit Medium", "text": "Feelings and visions blend until you can’t tell who cried first. Intuition guides every instinct. Home becomes your chapel of wonder." },
      "Leo": { "title": "Solar Prophet", "text": "You dramatize the divine until everyone pays attention. Creativity is your altar. Faith looks like a spotlight you willingly step into." },
      "Virgo": { "title": "Sacred Analyst", "text": "You translate dreams into blueprints. Practical magic is your specialty. Miracles get documented and iterated." },
      "Libra": { "title": "Aesthetic Mystic", "text": "Beauty opens your third eye. Harmony is a spiritual practice, not a compromise. Relationships become portals to alternate realities." },
      "Scorpio": { "title": "Shadow Visionary", "text": "You dive into psychic trenches and bring back alchemical truths. Intensity fuels your intuition. Transformation lives on your tongue." },
      "Sagittarius": { "title": "Nomadic Oracle", "text": "You follow vision quests across continents and philosophies. Faith must stay mobile. Synchronicities hitchhike in your wake." },
      "Capricorn": { "title": "Mythic Architect", "text": "You lay foundations for dreams to survive harsh climates. Discipline makes the impossible practical. Destiny listens when you draft timelines." },
      "Aquarius": { "title": "Signal Dreamer", "text": "You channel collective futures before they trend. Detachment keeps your downloads clear. Visionary blueprints come with upgrade instructions." },
      "Pisces": { "title": "Oceanic Sage", "text": "You dissolve into universal tides and resurface with compassion. Boundaries blur into love letters. Reality softens under your gaze." }
    },
    "Pluto": {
      "Aries": { "title": "Combustion Forge", "text": "You reinvent yourself through scorched-earth beginnings. Power arrives when you dare first and ask later. Conflict is your preferred catalyst." },
      "Taurus": { "title": "Obsidian Root", "text": "You transform through unshakable possession and letting go. Resources become talismans. Control is reclaimed by outlasting everything." },
      "Gemini": { "title": "Cipher Breaker", "text": "You weaponize information to expose what’s rotten. Conversations become interrogations. Curiosity digs graves for old lies." },
      "Cancer": { "title": "Ancestral Phoenix", "text": "You rebuild emotional empires from ashes. Family karma bows to your resilience. Vulnerability becomes a sharpened tool." },
      "Leo": { "title": "Solar Dominion", "text": "You transmute ego into sovereignty. Power radiates when you embrace radical authenticity. Attention is your chosen crucible." },
      "Virgo": { "title": "Purification Engine", "text": "You dismantle dysfunction with surgical precision. Transformation happens one system at a time. Control thrives in the details." },
      "Libra": { "title": "Balance Reforged", "text": "You expose the shadow contracts behind every partnership. Justice demands intensity. Harmony can’t exist without truth." },
      "Scorpio": { "title": "Underworld Monarch", "text": "You embody metamorphosis itself. Secrets kneel or combust. Power feels natural because you earned it in the dark." },
      "Sagittarius": { "title": "Dogma Burner", "text": "You incinerate outdated beliefs and preach rebirth. Truth is a weapon you wield globally. Expansion requires total surrender." },
      "Capricorn": { "title": "Empire Reclaimer", "text": "You dismantle corrupt structures and rebuild them with iron ethics. Authority is your surgical field. Legacy is a controlled detonation." },
      "Aquarius": { "title": "Revolt Catalyst", "text": "You mutate society through radical blueprints. Collective power surges when you flip the grid. Detachment helps you pull big levers." },
      "Pisces": { "title": "Abyss Weaver", "text": "You dissolve power structures in oceans of empathy. Surrender becomes alchemy. Spirituality is your pressure cooker." }
    },
    "Ascendant": {
      "Aries": { "title": "The Spark", "text": "You enter rooms like a flare gun. People clock your intent before your name. Momentum is your calling card." },
      "Taurus": { "title": "The Pillar", "text": "You move with deliberate gravity. Calm radiates even when you’re plotting. Others instinctively trust your pace." },
      "Gemini": { "title": "The Relay", "text": "You greet the world with quicksilver curiosity. Expressions change faster than people can keep up. Every interaction feels like breaking news." },
      "Cancer": { "title": "The Tide", "text": "You read energies before handshakes finish. Soft edges hide armored instincts. People feel both seen and inspected." },
      "Leo": { "title": "The Beacon", "text": "Presence arrives before you speak. Confidence is your default posture. Drama follows because you set the stage." },
      "Virgo": { "title": "The Filter", "text": "You present as composed, efficient, and observant. First impressions come with quiet assessments. Every detail feeds your conclusions." },
      "Libra": { "title": "The Mirror", "text": "You reflect others with elegance and subtle judgment. Charm is your shield. Harmony is enforced through poise." },
      "Scorpio": { "title": "The Cipher", "text": "You radiate intrigue wrapped in control. People sense the x-ray gaze. Power enters with you even when you’re silent." },
      "Sagittarius": { "title": "The Horizon", "text": "You step in like an expedition leader. Optimism and blunt truth travel together. People expect stories when you start talking." },
      "Capricorn": { "title": "The Summit", "text": "Authority clings to you on sight. Seriousness isn’t a mood—it’s your aura. Others assume you’re in charge because you already act like it." },
      "Aquarius": { "title": "The Frequency", "text": "You carry an offbeat signal that intrigues and unnerves. Detachment keeps you unpredictable. People remember you as the original one." },
      "Pisces": { "title": "The Mirage", "text": "You arrive as a soft focus dream. Boundaries blur on impact. Empathy pours out before you realize you’re giving it." }
    },
    "Midheaven": {
      "Aries": { "title": "Trailblaze MC", "text": "Your public path demands courage and fresh starts. Careers move when you initiate. Legacy favors your risks." },
      "Taurus": { "title": "Evergreen MC", "text": "You build reputations like vineyards—slow, lush, and profitable. Stability becomes your brand. Others trust your long game." },
      "Gemini": { "title": "Broadcast MC", "text": "Visibility comes through words, media, or relentless networking. Careers change as often as your interests. Greatness thrives on adaptability." },
      "Cancer": { "title": "Sanctuary MC", "text": "You become known for caretaking, protection, or emotional intelligence. Legacy is family-shaped. Leadership feels maternal, not meek." },
      "Leo": { "title": "Spotlight MC", "text": "You’re meant to be seen. Career success demands creativity and unapologetic pride. Recognition isn’t vanity—it’s proof of impact." },
      "Virgo": { "title": "Craft MC", "text": "You climb through service, expertise, and consistent refinement. Perfectionism is your signature. People rely on your impeccable standards." },
      "Libra": { "title": "Diplomat MC", "text": "Public life revolves around aesthetics, partnerships, or negotiation. Reputation rests on fairness. You shape culture through elegance." },
      "Scorpio": { "title": "Phoenix MC", "text": "You become known for surviving and transforming. Power roles fit because you already speak fluent intensity. Influence requires secrecy and depth." },
      "Sagittarius": { "title": "Oracle MC", "text": "You thrive in roles that spread ideas across borders—teaching, travel, philosophy. Public mission: expand minds. Authenticity is non-negotiable." },
      "Capricorn": { "title": "Legacy MC", "text": "You’re here to build a monument of achievement. Ambition is the engine, endurance the fuel. Respect arrives because you outwork everyone." },
      "Aquarius": { "title": "Reform MC", "text": "You lead revolutions, collectives, or tech movements. Society expects innovation from you. Legacy hinges on your ability to stay ahead of time." },
      "Pisces": { "title": "Mystic MC", "text": "You become known for intuition, art, or spiritual service. Careers blur boundaries between reality and dream. Compassion is your public currency." }
    }
  },
  "aspects": {
    "Sun": {
      "Moon": {
        "conjunction": { "title": "Unified Self", "text": "Your head and heart share a single microphone. Confidence feels native because there’s no internal dissent. People feel how certain you are." },
        "opposition": { "title": "Solar Eclipse", "text": "You oscillate between spotlight and safe house. Wants and needs pull you like tides. Balance comes from honoring both identities." },
        "square": { "title": "Internal Mutiny", "text": "Your ego argues with your emotions in surround sound. You sabotage comfort just to prove a point. Growth demands choosing collaboration over combat." },
        "trine": { "title": "Grace Flow", "text": "Authenticity is effortless; reactions sync with intentions. Emotional expression amplifies your charisma. People trust you because you move in one direction." },
        "sextile": { "title": "Aligned Currents", "text": "Self-expression and instincts work in tandem. You act quickly when feelings signal yes. Small adjustments create smooth momentum." }
      },
      "Mars": {
        "conjunction": { "title": "Combust Drive", "text": "Your willpower and action fuse into a single punch. Waiting feels like suffocation. Momentum is your default state." },
        "opposition": { "title": "Voltage Duel", "text": "Identity and impulse tug-of-war for control. You flip between bold statements and brutal overreactions. Discipline keeps the fuse intact." },
        "square": { "title": "Friction Forge", "text": "You chase conflict like it’s cardio. Pride triggers aggression the moment you feel blocked. Mastery arrives when you aim the fire." },
        "trine": { "title": "Blaze Route", "text": "You take action the moment ego calls for evolution. Confidence plus speed equals undeniable magnetism. Wins happen because you refuse hesitation." },
        "sextile": { "title": "Primed Engine", "text": "Energy ignites easily when purpose knocks. Initiative feels natural and sustainable. Ambition sparks cooperation." }
      },
      "Jupiter": {
        "conjunction": { "title": "Golden Aura", "text": "Optimism and identity merge into a beacon. You attract chances by assuming they’re already yours. Generosity amplifies your influence." },
        "opposition": { "title": "Overreach Axis", "text": "Confidence bloats into gamble-mode. You toggle between righteous certainty and reckless faith. Humility keeps the expansion real." },
        "square": { "title": "Excess Engine", "text": "You treat limits like rumors. Growth for its own sake drains your focus. Discipline turns your big vision into a blueprint." },
        "trine": { "title": "Fortune Flow", "text": "Charisma plus purpose equals effortless doors opening. Teaching and leading feel natural. Luck arrives because you act bold with integrity." },
        "sextile": { "title": "Opportunity Pulse", "text": "You spot openings quickly and step into them with grace. Confidence syncs with wisdom. Small risks yield outsized rewards." }
      },
      "Saturn": {
        "conjunction": { "title": "Iron Backbone", "text": "Identity is welded to responsibility. You carry authority even when silent. Ambition matures through relentless self-audit." },
        "opposition": { "title": "Authority Clash", "text": "Your ego resists external control, yet craves validation. You oscillate between defiance and duty. Integrating both creates unshakable leadership." },
        "square": { "title": "Pressure Crucible", "text": "Self-doubt rides shotgun with ambition. Every move feels graded. Success arrives when you transmute criticism into calibration." },
        "trine": { "title": "Stoic Mastery", "text": "Structure supports your shine. Discipline flows without drama. People trust you because you deliver what you promise." },
        "sextile": { "title": "Measured Authority", "text": "You mix humility with confidence and get steady growth. Planning stabilizes your identity. Respect accumulates quietly." }
      },
      "Uranus": {
        "conjunction": { "title": "Lightning Core", "text": "You live in perpetual jailbreak mode. Authenticity means shocking the system. Freedom isn’t optional; it’s your oxygen." },
        "opposition": { "title": "Voltage Tug", "text": "You oscillate between craving stability and detonating it. Identity rebels against expectation at inconvenient times. Integration means owning both needs." },
        "square": { "title": "Disruption Reflex", "text": "You burn bridges just to see what new skyline appears. Authority nerves you, conformity enrages you. Channel rebellion into invention, not implosion." },
        "trine": { "title": "Futurist Flow", "text": "You innovate simply by breathing. Originality feels effortless. The world adjusts to your frequency, not the reverse." },
        "sextile": { "title": "Pulse Shift", "text": "You toggle change on with precision. Personal freedom expands through collaboration. Upgrades arrive the moment complacency whispers." }
      },
      "Neptune": {
        "conjunction": { "title": "Mythic Self", "text": "You project yourself like a living legend. Boundaries blur; inspiration floods. Clarity requires grounding, not surrender." },
        "opposition": { "title": "Mirage Axis", "text": "You toggle between raw ego and total dissolution. Disillusion wakes you up. Keep vision tethered to proof." },
        "square": { "title": "Fog Forge", "text": "You chase ideals even when the map is blank. Confusion breeds escapism. Anchor the dream before you launch it." },
        "trine": { "title": "Enchanted Current", "text": "Creativity flows straight from source. Compassion radiates through your presence. Intent and intuition harmonize." },
        "sextile": { "title": "Inspired Pulse", "text": "You sense opportunities to blend imagination with identity. Soft power opens doors. Spiritual nudges guide bold moves." }
      },
      "Pluto": {
        "conjunction": { "title": "Power Core", "text": "You broadcast intensity that can’t be ignored. Transformation starts wherever you stand. People feel both intrigued and unsettled." },
        "opposition": { "title": "Dominion Clash", "text": "You attract power struggles that mirror your own force. Control issues surface fast. Mastery means owning your shadow before it owns you." },
        "square": { "title": "Inferno Forge", "text": "Your evolution arrives via pressure and confrontation. Ego deaths are regular programming. Rebirth becomes your signature move." },
        "trine": { "title": "Magnetic Sovereign", "text": "Authority and depth align. You regenerate with ease and lead through raw authenticity. Influence follows naturally." },
        "sextile": { "title": "Catalyst Current", "text": "You sense when to pivot and rebirth. Personal power grows quietly but unmistakably. Transformation partners with purpose." }
      },
      "Ascendant": {
        "conjunction": { "title": "Living Spotlight", "text": "Identity and presentation fuse. You walk in and everyone already knows your vibe. Authenticity is your first impression." },
        "opposition": { "title": "Mirrored Ego", "text": "Partners reflect the parts of you you won’t admit. Public self clashes with relational needs. Integration requires honest visibility." },
        "square": { "title": "Image Tension", "text": "You project confidence while wrestling with self-definition. External pressure sharpens your persona. Owning your edges eases the friction." },
        "trine": { "title": "Effortless Presence", "text": "Your core self reads clearly on the surface. People perceive you exactly as you intend. Doors open because your vibe is consistent." },
        "sextile": { "title": "Calibrated Aura", "text": "You fine-tune how others see you without faking it. Identity becomes a flexible asset. Collaboration amplifies your shine." }
      },
      "Midheaven": {
        "conjunction": { "title": "Crowned Path", "text": "Your career and ego share a destiny. Public roles feel personal. You’re built to be recognized for being unapologetically you." },
        "opposition": { "title": "Stage Balance", "text": "Home life tugs against public ambition. You’re pulled between personal authenticity and professional expectation. Claim both or neither works." },
        "square": { "title": "Ambition Static", "text": "Self-image and career direction brawl for control. Pressure drives reinvention. Success shows when you align your brand with your truth." },
        "trine": { "title": "Zenith Flow", "text": "Professional visibility matches your innate confidence. Recognition arrives organically. Purpose feels like sunlight." },
        "sextile": { "title": "Trajectory Sync", "text": "You navigate public spaces with ease. Personal goals dovetail with career moves. Intent plus timing equals ascent." }
      }
    },
    "Moon": {
      "Mercury": {
        "conjunction": { "title": "The Storyteller", "text": "Feelings and words share the same bloodstream. You narrate emotions before they solidify. Conversations become therapy sessions for everyone involved." },
        "opposition": { "title": "Heart vs. Head", "text": "You ping-pong between logic and instinct. Saying what you feel and feeling what you say rarely sync. Integration comes from letting both speak without censorship." },
        "square": { "title": "Emotional Static", "text": "Thoughts argue with gut reactions on loop. You over-explain feelings or bury them under facts. Breathing space rewires the feedback loop." },
        "trine": { "title": "Fluid Interpreter", "text": "You translate moods into perfect language. Others feel seen because you articulate what they can’t. Intuition and intellect co-sign every message." },
        "sextile": { "title": "Quick Relay", "text": "You connect emotions to explanations on demand. Small talks turn into meaningful repairs. Curiosity steadies your feelings." }
      },
      "Venus": {
        "conjunction": { "title": "Velvet Pulse", "text": "Emotional needs and affection synthesize. You nurture through beauty and love with protective warmth. People feel soothed in your orbit." },
        "opposition": { "title": "Comfort Standoff", "text": "Security and romance tug in opposite directions. You want softness but distrust it. Balance requires naming your needs out loud." },
        "square": { "title": "Tender Clash", "text": "You crave affection yet bristle at compromise. Emotional reactions sabotage harmony. Owning your vulnerability keeps relationships from fraying." },
        "trine": { "title": "Honey Flow", "text": "Feelings, pleasure, and care move seamlessly. You attract people who mirror your sweetness. Harmony feels effortless because it’s honest." },
        "sextile": { "title": "Warm Accord", "text": "You intuit how to comfort others without losing yourself. Small kindnesses ripple into trust. Emotional intelligence polishes your charm." }
      },
      "Mars": {
        "conjunction": { "title": "Volcanic Mood", "text": "Feelings ignite action instantly. Anger shows up as a protective instinct. You process emotions by doing, not discussing." },
        "opposition": { "title": "Trigger Axis", "text": "Sensitivity and impulsiveness yank each other’s chains. You defend loved ones fiercely, sometimes prematurely. Pause before declaring war." },
        "square": { "title": "Ember Clash", "text": "You swing between raw reaction and defensive shutdown. Emotional friction sparks conflict fast. Channel the heat into deliberate moves." },
        "trine": { "title": "Instinct Engine", "text": "Your gut fuels decisive action. Courage comes naturally when feelings align. Others rely on your emotional bravery." },
        "sextile": { "title": "Bold Pulse", "text": "You act when intuition nudges. Emotional honesty keeps your drive clean. Softness and strength cooperate." }
      },
      "Jupiter": {
        "conjunction": { "title": "Expansive Tide", "text": "Feelings swell with optimism. You feed others hope and gain faith in return. Emotional generosity rewrites the room." },
        "opposition": { "title": "Overflow Axis", "text": "You swing from indulgent empathy to emotional burnout. Boundaries wobble. Wisdom is knowing when to refill your own cup." },
        "square": { "title": "Excess Swell", "text": "You overdo caretaking or run from vulnerability with spiritual bypassing. Joy needs structure to stay real. Moderation is emotional medicine." },
        "trine": { "title": "Blessed Flow", "text": "Your inner world radiates warmth and resilience. Emotional honesty invites miracles. People feel lucky around you." },
        "sextile": { "title": "Hope Current", "text": "You spot silver linings quickly and share them generously. Feelings turn into philosophy without losing heart. Optimism steadies the tides." }
      },
      "Saturn": {
        "conjunction": { "title": "Fortress Heart", "text": "Emotions wear armor and move with duty. You love through reliability more than softness. Stability is your comfort zone." },
        "opposition": { "title": "Gravity Axis", "text": "You crave nurturing but distrust dependence. Walls go up when you’re most vulnerable. Balance comes from earned trust, not self-erasure." },
        "square": { "title": "Pressure Valve", "text": "You feel responsible for everything, which freezes expression. Emotional discipline becomes emotional repression. Letting others help is the growth edge." },
        "trine": { "title": "Granite Calm", "text": "You manage feelings with mature poise. Others lean on your steady presence. Caretaking includes sustainable boundaries." },
        "sextile": { "title": "Measured Warmth", "text": "You mix empathy with realism. Support becomes actionable advice. Security grows from consistent effort." }
      },
      "Uranus": {
        "conjunction": { "title": "Shockwave Mood", "text": "Feelings flip from zero to lightning without warning. Emotional freedom matters more than approval. You reinvent your reactions in real time." },
        "opposition": { "title": "Voltage Balance", "text": "Need for closeness competes with craving space. You detach to stay sane, then rush back in. Transparent boundaries prevent chaos." },
        "square": { "title": "Nervous Surge", "text": "Emotions feel like static electricity—restless, unpredictable. Routine suffocates you. Channel the volatility into creative rebellion." },
        "trine": { "title": "Electric Ease", "text": "Your intuition downloads breakthroughs. Emotional intelligence feels futuristic. People rely on your cool read of hot situations." },
        "sextile": { "title": "Spark Sync", "text": "You pivot emotionally with grace. Change refreshes your heart rather than rattling it. Innovation soothes you." }
      },
      "Neptune": {
        "conjunction": { "title": "Dream Surge", "text": "Feelings dissolve into oceanic empathy. You sense the room before words happen. Grounding keeps compassion from drowning you." },
        "opposition": { "title": "Fog Axis", "text": "You absorb others’ moods and lose track of your own. Boundaries glitch. Clarity requires retreat and honest reflection." },
        "square": { "title": "Tidal Blur", "text": "Escapism tempts when emotions overwhelm. Idealizing people leads to disillusion. Anchor your empathy with reality checks." },
        "trine": { "title": "Mystic Flow", "text": "You trust intuition like it’s GPS. Emotional healing arrives through art, sound, and silence. People feel spiritually rinsed around you." },
        "sextile": { "title": "Serene Pulse", "text": "You channel compassion with intention. Dreams guide practical decisions. Softness becomes a renewable resource." }
      },
      "Pluto": {
        "conjunction": { "title": "Shadow Tide", "text": "Feelings run subterranean and volcanic. You intuit motives instantly and guard secrets like currency. Emotional bonds transform everyone involved." },
        "opposition": { "title": "Depth Axis", "text": "You draw intense people who challenge your emotional control. Power struggles expose buried fears. Vulnerability becomes liberation." },
        "square": { "title": "Ember Depth", "text": "You wrestle with obsessive feelings and defensive instincts. Trust comes slowly but permanently. Emotional alchemy is your lifelong craft." },
        "trine": { "title": "Phoenix Heart", "text": "You regenerate emotionally with ease. Intensity fuels your empathy. Others experience catharsis just standing near your truth." },
        "sextile": { "title": "Catalyst Tide", "text": "You sense transformation opportunities inside any feeling. Emotional loyalty empowers you. Insight arrives like a scalpel." }
      }
    },
    "Mercury": {
      "Venus": {
        "conjunction": { "title": "Silver Tongue", "text": "Charm and logic merge into one persuasive current. You talk people into pleasure and peace without breaking a sweat. Diplomacy feels natural because you mean it." },
        "opposition": { "title": "Sweet Static", "text": "You debate yourself between saying what’s pretty and saying what’s true. Romantic choices get overthought. Balance arrives when honesty stays graceful." },
        "square": { "title": "Velvet Clash", "text": "You intellectualize feelings and sugarcoat facts. Attraction gets tangled in analysis. Own the friction; it sharpens your storytelling." },
        "trine": { "title": "Harmonic Wit", "text": "Words flow with effortless affection. Art, conversation, and connection braid together. You make diplomacy look easy." },
        "sextile": { "title": "Soft Circuit", "text": "You relay compliments that feel earned. Flirting doubles as friendship. Small gestures keep relationships well-tuned." }
      },
      "Mars": {
        "conjunction": { "title": "Verbal Blade", "text": "Your words hit like precision strikes. Debate is sport. You think fast, speak faster, and regret nothing." },
        "opposition": { "title": "Trigger Talk", "text": "Impulsive statements ignite arguments. Curiosity pokes at people who aren’t ready. Directness needs timing or it explodes." },
        "square": { "title": "Combust Wit", "text": "You weaponize sarcasm before feeling the fallout. Mental restlessness stirs conflict. Channel the fire into advocacy, not collateral damage." },
        "trine": { "title": "Saber Flow", "text": "Ideas launch with action behind them. You argue brilliantly because you believe what you say. Initiative and intellect sprint together." },
        "sextile": { "title": "Charged Relay", "text": "You pivot from thought to action smoothly. Motivation arrives when a plan forms. Allies trust your quick read on any situation." }
      },
      "Jupiter": {
        "conjunction": { "title": "Oracle Signal", "text": "You broadcast big truths with bigger enthusiasm. Optimism fuels your logic. Teaching and storytelling feel synonymous." },
        "opposition": { "title": "Preach Mode", "text": "You toggle between overexplaining and overselling. Faith challenges facts, then flips back. Humility keeps the insight potent." },
        "square": { "title": "Hyperbole Loop", "text": "You exaggerate for impact and lose precision. Philosophizing replaces follow-through. Trim the excess to keep credibility." },
        "trine": { "title": "Wisdom Current", "text": "Ideas scale effortlessly. Humor carries your sermons. People listen because you blend intellect with faith." },
        "sextile": { "title": "Bright Signal", "text": "Opportunities to learn and teach abound. Curiosity opens doors; optimism walks through. Mindset upgrades happen fast." }
      },
      "Saturn": {
        "conjunction": { "title": "Steel Logic", "text": "Your thoughts are audited before they escape. Discipline keeps your communication razor sharp. Serious topics are your playground." },
        "opposition": { "title": "Gatekeeper Mind", "text": "Responsibility clamps down on expression. You want to speak freely but self-censor. Trust builds when you allow nuance." },
        "square": { "title": "Rigid Echo", "text": "Doubt and duty choke creativity. You critique faster than you create. Structure your thinking without strangling it." },
        "trine": { "title": "Architect Brain", "text": "Strategy blends with articulation. People rely on your precise assessments. Consistency makes your words law." },
        "sextile": { "title": "Measured Voice", "text": "You balance realism with clarity. Advice hits with authority yet remains accessible. Planning supports every message." }
      },
      "Uranus": {
        "conjunction": { "title": "Shock Intel", "text": "Ideas crackle like live wires. You download innovations before they trend. Conversations feel like revolutions." },
        "opposition": { "title": "Voltage Ping", "text": "You oscillate between detachment and mental rebellion. Others can’t keep up with your pivots. Communicate the why behind the disruption." },
        "square": { "title": "Static Burst", "text": "You rebel mid-sentence and derail plans just to stay awake. Restlessness hacks your focus. Channel the chaos into genius projects." },
        "trine": { "title": "Radical Clarity", "text": "Insights arrive like lightning but land gracefully. You articulate the future fluently. People seek your unconventional logic." },
        "sextile": { "title": "Quantum Relay", "text": "You toggle upgrades on without frying circuits. Networking sparks breakthroughs. Curiosity thrives on novelty." }
      },
      "Neptune": {
        "conjunction": { "title": "Dream Signal", "text": "Your words ripple with myth and metaphor. Facts blur into poetry. Clarity requires intentional grounding." },
        "opposition": { "title": "Fog Dialogue", "text": "You sense truths but struggle to articulate them cleanly. Idealism conflicts with logic. Anchor ideas before releasing them." },
        "square": { "title": "Gauze Logic", "text": "You drift into fantasy mid-thought. Miscommunication breeds confusion. Translate intuition into evidence." },
        "trine": { "title": "Mystic Channel", "text": "Your intuition narrates with elegance. Stories heal because they feel enchanted. Creativity speaks fluent truth." },
        "sextile": { "title": "Lyrical Link", "text": "You weave imagination into everyday dialogue. Compassion sharpens your intelligence. Inspiration stays on standby." }
      },
      "Pluto": {
        "conjunction": { "title": "Psyche Decoder", "text": "Words penetrate like an MRI. You see motives and name them. Conversations become catalysts." },
        "opposition": { "title": "Power Ping", "text": "You attract mental chess matches and verbal power plays. Transparency disarms manipulation. Speak with intent, not intimidation." },
        "square": { "title": "Obsessive Loop", "text": "Thoughts fixate until you dismantle them. Arguments escalate into interrogations. Mastery lies in knowing when to release." },
        "trine": { "title": "Depth Dial", "text": "You wield language like transformation tech. Insights slice through superficiality. People confess because you already know." },
        "sextile": { "title": "Catalyst Mind", "text": "You sense the undercurrent in every dialogue. Precision meets intuition. Subtext becomes your superpower." }
      }
    },
    "Venus": {
      "Mars": {
        "conjunction": { "title": "Passionate Warrior", "text": "Desire and action fuse. You chase what you love and love what you chase. Chemistry turns into combustion fast." },
        "opposition": { "title": "Heat Standoff", "text": "Attraction flips between craving and conflict. You want harmony but ignite drama. Channel tension into creative fire." },
        "square": { "title": "Friction Flame", "text": "You fight for love and love the fight. Desire feels like a full-contact sport. Passion needs direction or it self-destructs." },
        "trine": { "title": "Magnetic Flow", "text": "Charm and confidence sync perfectly. You seduce by simply existing. Pursuit feels playful, not pressured." },
        "sextile": { "title": "Spark Accord", "text": "You blend affection with initiative. Romantic gestures land with impact. Energy stays lively yet cooperative." }
      },
      "Jupiter": {
        "conjunction": { "title": "Opulent Heart", "text": "Pleasure meets generosity and multiplies. You love big, spend bold, and expect miracles. Joy is your investment strategy." },
        "opposition": { "title": "Excess Axis", "text": "Indulgence duels with ethics. You oscillate between saint and hedonist. Moderation keeps the blessings flowing." },
        "square": { "title": "Gilded Rush", "text": "Overpromising and overloving drain your reserves. Luxury seduces your judgment. Anchor extravagance with intention." },
        "trine": { "title": "Grace Cascade", "text": "Abundance follows your affection. Relationships thrive on laughter, honesty, and big-hearted generosity. You make life feel richer." },
        "sextile": { "title": "Lucky Embrace", "text": "Opportunities to love and grow appear often. Appreciation attracts support. Hopefulness becomes magnetic." }
      },
      "Saturn": {
        "conjunction": { "title": "Iron Devotion", "text": "Love is a contract you honor with endurance. You show affection through loyalty and work. Romance matures into legacy." },
        "opposition": { "title": "Guarded Heart", "text": "Distance protects you, yet you crave closeness. Standards filter out the unworthy. Letting someone in becomes the real commitment." },
        "square": { "title": "Stone Rose", "text": "Affection feels delayed or conditional. You test before trusting. Patience teaches you how to soften without breaking." },
        "trine": { "title": "Steadfast Grace", "text": "You blend warmth with responsibility smoothly. Relationships grow slowly but securely. Beauty feels more real when it’s earned." },
        "sextile": { "title": "Reliable Charm", "text": "You balance romance with realism. Consistency becomes attractive. Love thrives on shared goals." }
      },
      "Uranus": {
        "conjunction": { "title": "Electric Heart", "text": "You fall for originals and become one. Freedom is your love language. Routine short-circuits desire." },
        "opposition": { "title": "Voltage Split", "text": "You crave closeness then bolt for autonomy. Relationships reboot often. Transparency about your rhythms keeps sparks alive." },
        "square": { "title": "Shock Romance", "text": "You rebel against predictable love. Drama erupts from sudden pivots. Channel disruption into creative connection, not chaos." },
        "trine": { "title": "Liberated Love", "text": "Affection thrives on experimentation. You make unconventional bonds look effortless. Authenticity keeps desire awake." },
        "sextile": { "title": "Spark Exchange", "text": "You invite freshness into every relationship. Inspiration keeps passion steady. Equality feels sexy." }
      },
      "Neptune": {
        "conjunction": { "title": "Mystic Muse", "text": "You romanticize everything and somehow make it real. Devotion feels sacred. Boundaries dissolve into poetry." },
        "opposition": { "title": "Haze Affair", "text": "You fall for fantasies and wake up bewildered. Idealism battles reality. Discernment protects your heart." },
        "square": { "title": "Glamour Drift", "text": "You confuse compassion with chemistry. Love stories blur into delusion. Ground your devotion in tangible acts." },
        "trine": { "title": "Enchanted Bond", "text": "You radiate unconditional love. Creativity and romance entwine. People feel seen soul-first." },
        "sextile": { "title": "Serene Allure", "text": "You sprinkle magic on every connection. Kindness feels seductive. Dreams become shared rituals." }
      },
      "Pluto": {
        "conjunction": { "title": "Feral Magnetism", "text": "You love with obsession, loyalty, and x-ray intuition. Relationships transform you on a cellular level. Intensity is mandatory." },
        "opposition": { "title": "Power Pivot", "text": "Attraction triggers power struggles. You crave devotion but fear surrender. Trust becomes alchemy when both sides own their shadows." },
        "square": { "title": "Obsidian Romance", "text": "You test lovers with emotional depth charges. Possession and passion wrestle. Healing requires surrendering control." },
        "trine": { "title": "Magnetic Bond", "text": "You attract soul-level connections that survive any storm. Desire fuels regeneration. Loyalty feels holy." },
        "sextile": { "title": "Catalyst Love", "text": "You sense when relationships need reinvention. Passion sparks growth, not drama. Emotional honesty wields power kindly." }
      }
    },
    "Mars": {
      "Jupiter": {
        "conjunction": { "title": "Thunder Charge", "text": "Action and expansion ignite simultaneously. Risk feels righteous. You leap first and figure the sermon out mid-air." },
        "opposition": { "title": "Flare Axis", "text": "Impulses inflate into overreach. You chase glory even when strategy says wait. Confidence needs calibration to stay lucky." },
        "square": { "title": "Excess Impact", "text": "You weaponize optimism and burn fuel too fast. Overcommitting leaves scorch marks. Aim the power; don’t spray it." },
        "trine": { "title": "Heroic Flow", "text": "Courage and growth sync perfectly. You lead by example and people rally. Momentum attracts spectacular wins." },
        "sextile": { "title": "Boost Circuit", "text": "Well-timed risks pay off. Motivation surges the moment opportunity appears. Collaboration multiplies your reach." }
      },
      "Saturn": {
        "conjunction": { "title": "Steel Engine", "text": "Discipline fuels your drive. You move with strategic force, not impulse. Obstacles crumble under your consistent pressure." },
        "opposition": { "title": "Brake vs. Gas", "text": "Duty drags while ambition accelerates. You oscillate between overdrive and freeze. Mastery arrives when you trust paced action." },
        "square": { "title": "Pressure Grind", "text": "Frustration builds when progress lags. Anger simmers behind stoicism. Channel the torque into structured breakthroughs." },
        "trine": { "title": "Fortified Drive", "text": "Your hustle has endurance built in. Authority backs your initiatives. Success compounds because you respect timing." },
        "sextile": { "title": "Measured Push", "text": "You blend caution with courage. Plans get executed cleanly. Allies rely on your reliability under stress." }
      },
      "Uranus": {
        "conjunction": { "title": "Rebel Surge", "text": "You act like a flash mob of one. Revolution is your reflex. Predictability doesn’t stand a chance." },
        "opposition": { "title": "Voltage Duel", "text": "Instinct craves disruption while circumstance demands restraint. Sudden pivots shake alliances. Freedom must be negotiated." },
        "square": { "title": "Chaos Drive", "text": "You detonate plans mid-stride just to stay awake. Adrenaline overrides strategy. Harness spontaneity into targeted innovation." },
        "trine": { "title": "Quantum Leap", "text": "You move fast and upgrade faster. Breakthroughs follow your daring. Progress feels electric and inevitable." },
        "sextile": { "title": "Shock Assist", "text": "You spot chances to change course instantly. Unusual tactics pay off. Collaboration thrives on your unpredictability." }
      },
      "Neptune": {
        "conjunction": { "title": "Mythic Drive", "text": "Action answers to vision. You fight for ideals with cinematic flair. Ground yourself so the crusade actually lands." },
        "opposition": { "title": "Fog Charge", "text": "You chase mirages at full speed. Motivation dissolves when reality contradicts fantasy. Anchor the mission before launching." },
        "square": { "title": "Diffuse Force", "text": "Energy leaks into escapism. You overpromise spiritually and underdeliver physically. Discipline keeps the dream intact." },
        "trine": { "title": "Inspired Motion", "text": "Intuition directs your moves. Creative campaigns manifest effortlessly. Compassion drives decisive action." },
        "sextile": { "title": "Vision Spark", "text": "You act when a higher purpose calls. Subtle nudges become swift maneuvers. Magic follows your conviction." }
      },
      "Pluto": {
        "conjunction": { "title": "Obsidian Force", "text": "Willpower runs nuclear. You dismantle obstacles with relentless focus. Power respects your name." },
        "opposition": { "title": "Control Clash", "text": "Intensity meets resistance head-on. You attract rivals who mirror your ferocity. Transformation happens when you stop wrestling your own shadow." },
        "square": { "title": "Inferno Drive", "text": "Compulsion fuels every move. You push until systems crack. Aim that ferocity at worthy missions only." },
        "trine": { "title": "Dominion Flow", "text": "Action and transformation cooperate. You magnetize influence by staying laser-focused. Regeneration follows every conquest." },
        "sextile": { "title": "Catalyst Surge", "text": "You sense strategic moments to strike. Quiet power turns decisive when needed. Alliances deepen through shared intensity." }
      }
    },
    "Jupiter": {
      "Saturn": {
        "conjunction": { "title": "Architect Creed", "text": "Expansion meets structure and builds empires. Optimism becomes policy. You treat patience like compound interest." },
        "opposition": { "title": "Doctrine Tug", "text": "Hope and caution alternate steering. You crave growth while policing every step. Integration means trusting the plan you designed." },
        "square": { "title": "Gravity Check", "text": "Overambition slams into regulations. Lessons feel like speed bumps. Discipline your vision without shrinking it." },
        "trine": { "title": "Legacy Flow", "text": "Wisdom and responsibility cooperate smoothly. You scale dreams sustainably. Respect follows your measured expansion." },
        "sextile": { "title": "Balanced Ascent", "text": "Opportunity arrives when preparation meets faith. You negotiate risk with maturity. Progress feels stable and earned." }
      },
      "Uranus": {
        "conjunction": { "title": "Liberation Surge", "text": "You evangelize revolutions. Growth arrives through radical upgrades. Fortune favors your audacity." },
        "opposition": { "title": "Shock Horizon", "text": "Stability and upheaval duel for dominance. Ideals yank you in sudden directions. Anchor the vision so change doesn’t derail purpose." },
        "square": { "title": "Wild Expansion", "text": "You gamble on experiments and chase freedom faster than plans form. Brilliant, chaotic, unforgettable. Risk smarter, not louder." },
        "trine": { "title": "Future Stream", "text": "Innovation multiplies your blessings. You broadcast progress and people follow. Serendipity syncs with bold thinking." },
        "sextile": { "title": "Spark Growth", "text": "You spot futuristic openings early. Community projects thrive on your optimism. Change feels exhilarating, not destabilizing." }
      },
      "Neptune": {
        "conjunction": { "title": "Sacred Vastness", "text": "Faith inflates into mythic proportions. Compassion scales. You dream in cinematic dimensions and expect reality to catch up." },
        "opposition": { "title": "Fog Horizon", "text": "Idealism stretches past practicality. You promise salvation then chase the next vision. Ground your generosity to keep it holy." },
        "square": { "title": "Mirage Quest", "text": "Hope outruns facts. Escapism masquerades as enlightenment. Check the map before preaching the path." },
        "trine": { "title": "Blessed Tide", "text": "Spiritual insight and optimism harmonize. You inspire without trying. Miracles hitch a ride on your intentions." },
        "sextile": { "title": "Grace Expansion", "text": "You sense divine timing and act on it. Creativity fuels abundance. Dreams scale through gentle persistence." }
      },
      "Pluto": {
        "conjunction": { "title": "Power Gospel", "text": "Conviction becomes a force field. You transform belief systems and people believe you. Influence digs deep roots." },
        "opposition": { "title": "Dominion Trial", "text": "Growth meets intense pressure to prove itself. You clash with power structures while building your own. Integrity must lead." },
        "square": { "title": "Volcanic Vision", "text": "You push agendas with unstoppable force. Obsession risks burnout. Temper zeal with nuance to avoid scorched earth." },
        "trine": { "title": "Sovereign Flow", "text": "Expansion and transformation collaborate. You regenerate opportunities from ashes. Authority feels destined." },
        "sextile": { "title": "Catalyst Creed", "text": "You spot chances to evolve entire systems. Influence grows quietly until it tips. Purpose fuels every move." }
      }
    },
    "Saturn": {
      "Uranus": {
        "conjunction": { "title": "Structured Revolt", "text": "You renovate systems from the inside. Discipline meets disruption and builds new scaffolding. Tradition never stays untouched in your orbit." },
        "opposition": { "title": "Tension Wire", "text": "Stability and rebellion yank you in opposite directions. You obey rules until the urge to jailbreak erupts. Balance means scheduling your revolutions." },
        "square": { "title": "Break/Build Forge", "text": "You swing between enforcing order and detonating it. Patience fractures under the need for change. Channel the strain into constructive upheaval." },
        "trine": { "title": "Precision Rebel", "text": "You disrupt with strategy, not impulse. Authority respects your upgrades because they work. Progress feels inevitable and grounded." },
        "sextile": { "title": "Calibrated Shock", "text": "You know when to tighten bolts and when to loosen them. Innovation fits neatly into timelines. Structure and surprise co-author your success." }
      },
      "Neptune": {
        "conjunction": { "title": "Sacred Framework", "text": "You give dreams a backbone. Compassion gets policies. Spiritual ambition becomes a blueprint." },
        "opposition": { "title": "Fog Discipline", "text": "Reality policing clashes with longing to dissolve boundaries. You alternate between martyrdom and detachment. Integrate rituals that respect both needs." },
        "square": { "title": "Misty Grind", "text": "You doubt your vision, then overcontrol it. Inspiration suffocates under rules. Allow magic scheduled room to breathe." },
        "trine": { "title": "Anchored Vision", "text": "Intuition trusts your structure. You manifest compassion through tangible work. Dreams stay enchanted yet efficient." },
        "sextile": { "title": "Practical Mystic", "text": "You quietly weave empathy into routines. Soft power meets steady results. Faith gets measurable outcomes." }
      },
      "Pluto": {
        "conjunction": { "title": "Iron Crucible", "text": "Responsibility and transformation fuse into relentless authority. You rebuild systems with surgical ruthlessness. Power answers when you knock." },
        "opposition": { "title": "Authority Rift", "text": "Control issues mirror from outside forces. You confront the structures you secretly embody. Evolution demands owning both sides." },
        "square": { "title": "Pressure Empire", "text": "You grind through intense rebuilding phases. Fear fights ambition; neither wins without surrender. Breakthroughs require trust in the process." },
        "trine": { "title": "Legacy Alchemy", "text": "You transform long-term goals with precision. Influence deepens because your changes last. People lean on your unshakeable resolve." },
        "sextile": { "title": "Forge Assist", "text": "You sense when to tighten or release control. Mutations happen methodically. Alliances strengthen through your dependable depth." }
      }
    },
    "Uranus": {
      "Neptune": {
        "conjunction": { "title": "Cosmic Patch", "text": "You jailbreak reality with dream-code. Collective consciousness downloads through you. The future feels mystical and wired." },
        "opposition": { "title": "Signal Fog", "text": "Detached logic clashes with oceanic empathy. You oscillate between visionary clarity and escapist static. Tune both frequencies intentionally." },
        "square": { "title": "Surreal Static", "text": "You rebel into fantasy and lose traction. Inspiration needs a router, not just lightning. Ground the vision to keep it revolutionary." },
        "trine": { "title": "Ethernet Muse", "text": "You channel transcendent ideas into practical disruption. Innovation feels guided. People sense you’re plugged into something bigger." },
        "sextile": { "title": "Dream Circuit", "text": "You connect weird inspirations with actionable change. Creativity sparks collaboration. Subtle downloads reshape systems." }
      },
      "Pluto": {
        "conjunction": { "title": "Radical Catalyst", "text": "You detonate corrupt systems and replace them with sharper tech. Power surges through your innovations. Transformation is your baseline." },
        "opposition": { "title": "Shock Dominion", "text": "You face shadowy forces while rewriting rules. Freedom and control duel constantly. Mastery requires directing the storm, not becoming it." },
        "square": { "title": "Rebellion Furnace", "text": "You push revolution so hard it backfires. Extremes attract equally intense opposition. Precision keeps upheaval effective." },
        "trine": { "title": "Quantum Authority", "text": "Change and power align gracefully. You evolve systems with eerie ease. Influence arrives because your ideas already feel inevitable." },
        "sextile": { "title": "Pulse Shift", "text": "You sense when society’s ready to upgrade. Quiet disruptions ripple outward. Partnerships thrive on your fearless originality." }
      }
    },
    "Neptune": {
      "Pluto": {
        "conjunction": { "title": "Depth Current", "text": "Mysticism and power merge into one undertow. You dissolve structures just to rebuild them with soul. Collective shifts follow your inner tides." },
        "opposition": { "title": "Mystic Standoff", "text": "Transcendence pulls while transformation grips hard. You toggle between surrender and domination. Integration requires trusting both instincts." },
        "square": { "title": "Abyss Forge", "text": "Spiritual longing collides with compulsion. Escapism battles obsession. Alchemize the tension into art that hits nerve endings." },
        "trine": { "title": "Sacred Undertow", "text": "You channel unseen forces gracefully. Healing feels inevitable. Power becomes compassionate without losing voltage." },
        "sextile": { "title": "Veil Shift", "text": "You sense subtle moments to regenerate reality. Visionary compassion nudges systems to evolve. Quiet moves ripple loud." }
      }
    },
    "Ascendant": {
      "Sun": {
        "conjunction": { "title": "Radiant Persona", "text": "Identity and first impression are one signal. You walk in as the truest version of yourself. People immediately grasp your mission." },
        "opposition": { "title": "Projection Axis", "text": "Partners mirror the parts of you you hide. You balance self-focus with relational diplomacy. Authenticity needs audience awareness." },
        "square": { "title": "Image Friction", "text": "Outer posture and inner aim rub raw. Reinvention happens on camera. Owning your contradictions stabilizes your vibe." },
        "trine": { "title": "Seamless Aura", "text": "Your presence broadcasts confidence without trying. Purpose reads clearly on your face. Opportunities meet you halfway." },
        "sextile": { "title": "Aligned Front", "text": "You tweak appearances to spotlight your goals. Collaboration elevates your visibility. Adaptability stays authentic." }
      },
      "Moon": {
        "conjunction": { "title": "Empath Mask", "text": "Feelings sit right on the surface. People read your moods before you speak. Softness becomes a signature expression." },
        "opposition": { "title": "Heart Mirror", "text": "Public composure versus private tides. Relationships trigger emotional recalibration. Balance means letting trusted people backstage." },
        "square": { "title": "Reactive Aura", "text": "You broadcast what you haven’t processed. External feedback rattles your security. Ground yourself before engagement." },
        "trine": { "title": "Lunar Poise", "text": "Instinct and presentation harmonize. You nurture spaces simply by entering. Emotional intelligence colors your style." },
        "sextile": { "title": "Gentle Signal", "text": "You share just enough softness to invite trust. Allies feel safe leaning in. Public grace stays honest." }
      },
      "Mercury": {
        "conjunction": { "title": "Spoken Face", "text": "Your words define your presence. Quick wit anchors first impressions. You narrate yourself in real time." },
        "opposition": { "title": "Signal Split", "text": "Mind and appearance debate the message. You analyze while others expect action. Spell out your perspective to bridge the gap." },
        "square": { "title": "Static Persona", "text": "Nerves scramble delivery. You overthink every gesture. Clarity returns when you trust your script." },
        "trine": { "title": "Fluent Persona", "text": "Charm and intellect sync. Conversations open doors on contact. You’re remembered for your agile mind." },
        "sextile": { "title": "Quick Calibration", "text": "You adjust tone instantly. Networking feels natural because curiosity leads. Rapport happens on cue." }
      },
      "Venus": {
        "conjunction": { "title": "Magnetic Shell", "text": "Beauty and presence fuse. You draw admiration effortlessly. Style is your calling card." },
        "opposition": { "title": "Charm Axis", "text": "People project desires onto you, while you seek genuine connection. Balance requires selective vulnerability." },
        "square": { "title": "Polished Tension", "text": "You look composed while wrestling with approval cravings. Self-worth needs to outrank applause." },
        "trine": { "title": "Velvet Aura", "text": "Grace pours off you. Relationships start smoothly because kindness is visible. Harmony is your baseline aesthetic." },
        "sextile": { "title": "Curated Glow", "text": "You know how to present the most appealing version of yourself without faking it. Collaboration boosts your shine." }
      },
      "Mars": {
        "conjunction": { "title": "Battle Front", "text": "You enter like a mission in boots. Vitality is obvious. People know you mean business." },
        "opposition": { "title": "Action Mirror", "text": "Partners trigger your fight-or-flight reflex. You stride between confrontation and cooperation. Negotiation becomes a survival skill." },
        "square": { "title": "Friction Field", "text": "You look intense even when calm. Others test you just to see your response. Strategic restraint protects your energy." },
        "trine": { "title": "Warrior Poise", "text": "Confidence reads clean. Initiative and impression sync. You handle challenges the moment they appear." },
        "sextile": { "title": "Primed Presence", "text": "You pivot quickly without losing composure. Leadership opportunities find you. Action feels stylish." }
      },
      "Jupiter": {
        "conjunction": { "title": "Open Horizon", "text": "Optimism beams through your posture. People assume you have answers. Luck trails your introduction." },
        "opposition": { "title": "Preach Mirror", "text": "Public persona, private beliefs—sometimes mismatched. Feedback teaches humility. Share the philosophy, not just the performance." },
        "square": { "title": "Grand Facade", "text": "You promise more than you can show. Image inflation breeds skepticism. Ground the hype with receipts." },
        "trine": { "title": "Blessed Presence", "text": "Opportunities blossom when you walk in. Enthusiasm reads as sincerity. People feel expanded around you." },
        "sextile": { "title": "Bright Contact", "text": "Networking sparks growth quickly. You meet mentors at every crossroads. Generosity keeps the flow going." }
      },
      "Saturn": {
        "conjunction": { "title": "Stone Face", "text": "You look serious because you are. Authority clings to your entrance. Expectations rise instantly." },
        "opposition": { "title": "Duty Axis", "text": "Personal freedom wrestles with public obligation. Partnerships challenge your stoicism. Vulnerability becomes the real discipline." },
        "square": { "title": "Rigid Shell", "text": "You guard first impressions like classified intel. Pressure builds behind the mask. Softening doesn’t erase respect." },
        "trine": { "title": "Fortified Presence", "text": "Responsibility looks elegant on you. People trust your steadiness. Legacy work starts with your introduction." },
        "sextile": { "title": "Measured Mask", "text": "You modulate seriousness to fit the moment. Reliability becomes attractive. Allies appreciate your composure." }
      },
      "Uranus": {
        "conjunction": { "title": "Live Wire", "text": "You radiate unpredictability. First impressions feel like plot twists. Authentic weirdness equals magnetism." },
        "opposition": { "title": "Shock Mirror", "text": "Relationships challenge your need for freedom. You toggle between lightning bolt and ghost. Boundaries make rebellion sustainable." },
        "square": { "title": "Electric Static", "text": "You rebrand yourself mid-conversation. People struggle to catch up. Focus the flair to keep traction." },
        "trine": { "title": "Future Aura", "text": "You look like tomorrow and mean it. Insights drop casually. Communities adore your originality." },
        "sextile": { "title": "Pivot Charm", "text": "You adapt instantly and inspire others to do the same. Invitations arrive from eclectic circles." }
      },
      "Neptune": {
        "conjunction": { "title": "Mirage Mask", "text": "You appear ethereal, unreadable, and strangely familiar. People project dreams onto you. Grounding keeps you from dissolving." },
        "opposition": { "title": "Fog Mirror", "text": "Others see what they want while you crave clarity. Boundaries flicker. Speak your reality before it gets rewritten." },
        "square": { "title": "Blurred Front", "text": "You shapeshift involuntarily. Confusion trails your introductions. Anchor your image in truth." },
        "trine": { "title": "Dream Sheen", "text": "You glide in with subtle magic. Kindness and intuition show on your face. People exhale around you." },
        "sextile": { "title": "Soft Focus", "text": "Empathy colors your aura. You attract collaborators through compassion. Mystique is your quiet brand." }
      },
      "Pluto": {
        "conjunction": { "title": "Obsidian Gaze", "text": "Your stare alone feels like an x-ray. Presence radiates intensity. Power introduces you before you speak." },
        "opposition": { "title": "Shadow Axis", "text": "You draw catalytic partnerships. Others reflect buried fears and hunger. Integration requires radical honesty." },
        "square": { "title": "Magnet Tension", "text": "People sense your force and react defensively. You either intimidate or entrance. Own the gravity to soften the edges." },
        "trine": { "title": "Underworld Poise", "text": "You exude depth and command. Transformation follows wherever you show up. Influence feels inevitable." },
        "sextile": { "title": "Quiet Power", "text": "You wield subtle control. Allies respect your unwavering focus. Presence alone shifts dynamics." }
      }
    },
    "Midheaven": {
      "Sun": {
        "conjunction": { "title": "Crown Trajectory", "text": "Career and identity align. You’re known for being undeniably you. Visibility is part of the job description." },
        "opposition": { "title": "Zenith Balance", "text": "Home base pulls against public ambition. Relatives keep you grounded while the world watches. Integrate both or burn out." },
        "square": { "title": "Brand Strain", "text": "Self-definition and reputation clash. Reinvention happens in public. Own the narrative before it owns you." },
        "trine": { "title": "Solar Path", "text": "Recognition follows authenticity. Your name becomes synonymous with your craft. Confidence scales your success." },
        "sextile": { "title": "Trajectory Sync", "text": "Personal goals dovetail with career moves. Collaboration resizes your spotlight. Progress feels natural." }
      },
      "Moon": {
        "conjunction": { "title": "Caretaker Status", "text": "Public persona and emotional life intertwine. You’re known for empathy and protection. Success feels hollow without feeling." },
        "opposition": { "title": "Axis of Comfort", "text": "Private needs battle public duty. Family tethers you when ambition roars. Emotional honesty sustains your reputation." },
        "square": { "title": "Mood Stage", "text": "Reputation fluctuates with your tides. Oversharing or secrecy complicates leadership. Emotional hygiene is career maintenance." },
        "trine": { "title": "Lunar Career", "text": "You nurture on a grand scale. People trust your instincts. Soft power opens elite doors." },
        "sextile": { "title": "Gentle Ascent", "text": "You read rooms and respond with tact. Support roles lead to authority. Compassion brands your legacy." }
      },
      "Mercury": {
        "conjunction": { "title": "Broadcast Peak", "text": "Your career rides on intellect and communication. Headlines follow your commentary. Words are your ladder." },
        "opposition": { "title": "Signal Axis", "text": "Private analysis competes with public messaging. You need quiet think time to stay sharp on stage." },
        "square": { "title": "Noise Strain", "text": "Overthinking muddles your brand. Mixed messages stall momentum. Simplify the narrative." },
        "trine": { "title": "Clarity Crest", "text": "You explain complex ideas effortlessly. Authority grows through consistent messaging. Public trust follows your logic." },
        "sextile": { "title": "Network Lift", "text": "Contacts boost your path upward. You adapt quickly to new platforms. Curiosity keeps you relevant." }
      },
      "Venus": {
        "conjunction": { "title": "Aesthetic Zenith", "text": "Charm and artistry headline your career. You’re remembered for elegance and diplomacy. Success must feel beautiful." },
        "opposition": { "title": "Polish Balance", "text": "Public poise versus private authenticity. Relationships influence your reputation. Boundaries keep the two aligned." },
        "square": { "title": "Gloss Tension", "text": "You juggle being likable with being real. Favor isn’t the same as respect. Let values steer the brand." },
        "trine": { "title": "Velvet Legacy", "text": "Partnerships and aesthetics elevate your status. You excel in art, diplomacy, or hospitality. Grace equals currency." },
        "sextile": { "title": "Charm Ladder", "text": "Opportunities arrive through social finesse. Collaboration polishes your image. You sell visions effortlessly." }
      },
      "Mars": {
        "conjunction": { "title": "Command Peak", "text": "Ambition thrusts you into leadership. You’re known for decisive moves. Competition recognizes you as the bar." },
        "opposition": { "title": "Drive Axis", "text": "Domestic demands tug against career crusades. You fight to balance both. Delegation equals survival." },
        "square": { "title": "Pressure Launch", "text": "You go hard and hit resistance. Public conflicts raise your profile. Channel aggression into strategy, not spectacle." },
        "trine": { "title": "Action Summit", "text": "Initiative and reputation reinforce each other. You conquer goals visibly. People expect you to deliver under fire." },
        "sextile": { "title": "Momentum Edge", "text": "You seize chances in real time. Projects accelerate because of your presence. Allies value your stamina." }
      },
      "Jupiter": {
        "conjunction": { "title": "Mission Crest", "text": "You’re known for big vision and bigger generosity. Careers bloom through teaching, travel, or philosophy. Success must inspire." },
        "opposition": { "title": "Scope Axis", "text": "Ambition stretches your roots thin. Home life checks your ego. Integrate meaning before expansion." },
        "square": { "title": "Hype Plateau", "text": "You overextend professionally. Public promises demand proof. Temper enthusiasm with logistics." },
        "trine": { "title": "Fortune Crest", "text": "You attract luck by living your beliefs publicly. Recognition multiplies when you lead ethically." },
        "sextile": { "title": "Opportunity Rise", "text": "Mentors appear often; doors open easily. Gratitude keeps you elevated." }
      },
      "Saturn": {
        "conjunction": { "title": "Authority Apex", "text": "Responsibility defines your reputation. You’re the anchor others depend on. Legacy is built brick by disciplined brick." },
        "opposition": { "title": "Duty Axis", "text": "Career gravity competes with private rest. You shoulder expectations even when you’re exhausted. Make room for softness." },
        "square": { "title": "Load Bearing", "text": "Obligations stack high. Failure isn’t an option, so stress spikes. Structure your rest like your work." },
        "trine": { "title": "Legacy Flow", "text": "Mastery looks effortless because you earned it. Promotions stick. Respect is non-negotiable." },
        "sextile": { "title": "Steady Rise", "text": "You climb through persistence and integrity. Allies trust your timelines. Small wins compound." }
      },
      "Uranus": {
        "conjunction": { "title": "Revolt Peak", "text": "You become known for shaking industries. Careers zig where others zag. Freedom is your career plan." },
        "opposition": { "title": "Shock Axis", "text": "Public unpredictability disrupts private stability. You chase breakthroughs and forget rest. Set ground rules for your genius." },
        "square": { "title": "Voltage Strain", "text": "Sudden career pivots jar your audience. Expect the unexpected becomes your tagline. Embrace reinvention intentionally." },
        "trine": { "title": "Future Crest", "text": "Innovation flows naturally into status. You lead cutting-edge movements. Authentic rebellion wins accolades." },
        "sextile": { "title": "Pivot Boost", "text": "You catch trend waves early. Collaborations keep your brand fresh. Flexibility equals fame." }
      },
      "Neptune": {
        "conjunction": { "title": "Mythic Peak", "text": "You’re revered for vision, art, or compassion. Public image feels otherworldly. Clarity keeps admirers from projecting fantasies." },
        "opposition": { "title": "Dream Axis", "text": "Private intuition clashes with public expectations. Rumors swirl unless you speak plainly. Guard your energy." },
        "square": { "title": "Fog Reputation", "text": "Misunderstandings cloud your career path. You’re idolized or doubted without reason. Transparency is your shield." },
        "trine": { "title": "Halo Path", "text": "Inspiration fuels your achievements. You make careers feel enchanted. Spiritual purpose aligns with legacy." },
        "sextile": { "title": "Vision Lift", "text": "Opportunities appear when you follow intuition. Compassion brands your leadership." }
      },
      "Pluto": {
        "conjunction": { "title": "Power Zenith", "text": "You wield influence that reshapes institutions. Reputation equals transformation. Authority is inevitable." },
        "opposition": { "title": "Dominion Axis", "text": "Public power clashes with personal vulnerability. Family or roots challenge your intensity. Humility keeps the crown." },
        "square": { "title": "Pressure Crest", "text": "You face public tests of will. Scandals or crises force reinvention. Survival becomes part of your brand." },
        "trine": { "title": "Sovereign Rise", "text": "You command respect through controlled intensity. Reforms succeed because you own them. Legacy feels unstoppable." },
        "sextile": { "title": "Catalyst Peak", "text": "You sense when to pull strings. Impact grows quietly, then all at once. Influence is a strategic tool." }
      }
    }
  }
}