{
  "stelliums": {
    "stellium_Aries": "You have 4 or more planets in Aries, this energy dominates everything. Bold, pioneering, instinctive energy runs your entire chart. You can't escape this focus, it's your default setting.",
    "stellium_Taurus": "You have 4 or more planets in Taurus, this energy dominates everything. Grounded, sensual, steady energy runs your entire chart. You can't escape this focus, it's your default setting.",
    "stellium_Gemini": "You have 4 or more planets in Gemini, this energy dominates everything. Curious, quick, versatile energy runs your entire chart. You can't escape this focus, it's your default setting.",
    "stellium_Cancer": "You have 4 or more planets in Cancer, this energy dominates everything. Protective, feeling-forward, nurturing energy runs your entire chart. You can't escape this focus, it's your default setting.",
    "stellium_Leo": "You have 4 or more planets in Leo, this energy dominates everything. Expressive, heart-led, magnetic energy runs your entire chart. You can't escape this focus, it's your default setting.",
    "stellium_Virgo": "You have 4 or more planets in Virgo, this energy dominates everything. Discerning, service-focused, precise energy runs your entire chart. You can't escape this focus, it's your default setting.",
    "stellium_Libra": "You have 4 or more planets in Libra, this energy dominates everything. Harmonizing, relational, diplomatic energy runs your entire chart. You can't escape this focus, it's your default setting.",
    "stellium_Scorpio": "You have 4 or more planets in Scorpio, this energy dominates everything. Intense, investigative, all-or-nothing energy runs your entire chart. You can't escape this focus, it's your default setting.",
    "stellium_Sagittarius": "You have 4 or more planets in Sagittarius, this energy dominates everything. Truth-seeking, adventurous, optimistic energy runs your entire chart. You can't escape this focus, it's your default setting.",
    "stellium_Capricorn": "You have 4 or more planets in Capricorn, this energy dominates everything. Strategic, disciplined, legacy-minded energy runs your entire chart. You can't escape this focus, it's your default setting.",
    "stellium_Aquarius": "You have 4 or more planets in Aquarius, this energy dominates everything. Visionary, future-focused, unconventional energy runs your entire chart. You can't escape this focus, it's your default setting.",
    "stellium_Pisces": "You have 4 or more planets in Pisces, this energy dominates everything. Sensitive, poetic, compassionate energy runs your entire chart. You can't escape this focus, it's your default setting.",
    "stellium_house_1": "You have 4 or more planets in the 1st house, self/identity/appearance consumes your life. This area is all-consuming, you can't ignore it. Everything revolves around this domain.",
    "stellium_house_2": "You have 4 or more planets in the 2nd house, money/values/resources consumes your life. This area is all-consuming, you can't ignore it. Everything revolves around this domain.",
    "stellium_house_3": "You have 4 or more planets in the 3rd house, communication/learning/siblings consumes your life. This area is all-consuming, you can't ignore it. Everything revolves around this domain.",
    "stellium_house_4": "You have 4 or more planets in the 4th house, home/family/roots consumes your life. This area is all-consuming, you can't ignore it. Everything revolves around this domain.",
    "stellium_house_5": "You have 4 or more planets in the 5th house, creativity/romance/play consumes your life. This area is all-consuming, you can't ignore it. Everything revolves around this domain.",
    "stellium_house_6": "You have 4 or more planets in the 6th house, work/health/service consumes your life. This area is all-consuming, you can't ignore it. Everything revolves around this domain.",
    "stellium_house_7": "You have 4 or more planets in the 7th house, partnerships/relationships consumes your life. This area is all-consuming, you can't ignore it. Everything revolves around this domain.",
    "stellium_house_8": "You have 4 or more planets in the 8th house, transformation/intimacy/shared resources consumes your life. This area is all-consuming, you can't ignore it. Everything revolves around this domain.",
    "stellium_house_9": "You have 4 or more planets in the 9th house, philosophy/travel/expansion consumes your life. This area is all-consuming, you can't ignore it. Everything revolves around this domain.",
    "stellium_house_10": "You have 4 or more planets in the 10th house, career/public life/legacy consumes your life. This area is all-consuming, you can't ignore it. Everything revolves around this domain.",
    "stellium_house_11": "You have 4 or more planets in the 11th house, community/friendships/ideals consumes your life. This area is all-consuming, you can't ignore it. Everything revolves around this domain.",
    "stellium_house_12": "You have 4 or more planets in the 12th house, spirituality/unconscious/solitude consumes your life. This area is all-consuming, you can't ignore it. Everything revolves around this domain."
  },
  "north_node": {
    "NorthNode_Aries_1": "Your North Node is in Aries in the 1st house. This is your life purpose, your soul mission. You're here to learn bold, pioneering, instinctive energy through self/identity/appearance. This is what you're growing toward, not where you start.",
    "NorthNode_Aries_2": "Your North Node is in Aries in the 2nd house. This is your life purpose, your soul mission. You're here to learn bold, pioneering, instinctive energy through money/values/resources. This is what you're growing toward, not where you start.",
    "NorthNode_Aries_3": "Your North Node is in Aries in the 3rd house. This is your life purpose, your soul mission. You're here to learn bold, pioneering, instinctive energy through communication/learning/siblings. This is what you're growing toward, not where you start.",
    "NorthNode_Aries_4": "Your North Node is in Aries in the 4th house. This is your life purpose, your soul mission. You're here to learn bold, pioneering, instinctive energy through home/family/roots. This is what you're growing toward, not where you start.",
    "NorthNode_Aries_5": "Your North Node is in Aries in the 5th house. This is your life purpose, your soul mission. You're here to learn bold, pioneering, instinctive energy through creativity/romance/play. This is what you're growing toward, not where you start.",
    "NorthNode_Aries_6": "Your North Node is in Aries in the 6th house. This is your life purpose, your soul mission. You're here to learn bold, pioneering, instinctive energy through work/health/service. This is what you're growing toward, not where you start.",
    "NorthNode_Aries_7": "Your North Node is in Aries in the 7th house. This is your life purpose, your soul mission. You're here to learn bold, pioneering, instinctive energy through partnerships/relationships. This is what you're growing toward, not where you start.",
    "NorthNode_Aries_8": "Your North Node is in Aries in the 8th house. This is your life purpose, your soul mission. You're here to learn bold, pioneering, instinctive energy through transformation/intimacy/shared resources. This is what you're growing toward, not where you start.",
    "NorthNode_Aries_9": "Your North Node is in Aries in the 9th house. This is your life purpose, your soul mission. You're here to learn bold, pioneering, instinctive energy through philosophy/travel/expansion. This is what you're growing toward, not where you start.",
    "NorthNode_Aries_10": "Your North Node is in Aries in the 10th house. This is your life purpose, your soul mission. You're here to learn bold, pioneering, instinctive energy through career/public life/legacy. This is what you're growing toward, not where you start.",
    "NorthNode_Aries_11": "Your North Node is in Aries in the 11th house. This is your life purpose, your soul mission. You're here to learn bold, pioneering, instinctive energy through community/friendships/ideals. This is what you're growing toward, not where you start.",
    "NorthNode_Aries_12": "Your North Node is in Aries in the 12th house. This is your life purpose, your soul mission. You're here to learn bold, pioneering, instinctive energy through spirituality/unconscious/solitude. This is what you're growing toward, not where you start.",
    "NorthNode_Taurus_1": "Your North Node is in Taurus in the 1st house. This is your life purpose, your soul mission. You're here to learn grounded, sensual, steady energy through self/identity/appearance. This is what you're growing toward, not where you start.",
    "NorthNode_Taurus_2": "Your North Node is in Taurus in the 2nd house. This is your life purpose, your soul mission. You're here to learn grounded, sensual, steady energy through money/values/resources. This is what you're growing toward, not where you start.",
    "NorthNode_Taurus_3": "Your North Node is in Taurus in the 3rd house. This is your life purpose, your soul mission. You're here to learn grounded, sensual, steady energy through communication/learning/siblings. This is what you're growing toward, not where you start.",
    "NorthNode_Taurus_4": "Your North Node is in Taurus in the 4th house. This is your life purpose, your soul mission. You're here to learn grounded, sensual, steady energy through home/family/roots. This is what you're growing toward, not where you start.",
    "NorthNode_Taurus_5": "Your North Node is in Taurus in the 5th house. This is your life purpose, your soul mission. You're here to learn grounded, sensual, steady energy through creativity/romance/play. This is what you're growing toward, not where you start.",
    "NorthNode_Taurus_6": "Your North Node is in Taurus in the 6th house. This is your life purpose, your soul mission. You're here to learn grounded, sensual, steady energy through work/health/service. This is what you're growing toward, not where you start.",
    "NorthNode_Taurus_7": "Your North Node is in Taurus in the 7th house. This is your life purpose, your soul mission. You're here to learn grounded, sensual, steady energy through partnerships/relationships. This is what you're growing toward, not where you start.",
    "NorthNode_Taurus_8": "Your North Node is in Taurus in the 8th house. This is your life purpose, your soul mission. You're here to learn grounded, sensual, steady energy through transformation/intimacy/shared resources. This is what you're growing toward, not where you start.",
    "NorthNode_Taurus_9": "Your North Node is in Taurus in the 9th house. This is your life purpose, your soul mission. You're here to learn grounded, sensual, steady energy through philosophy/travel/expansion. This is what you're growing toward, not where you start.",
    "NorthNode_Taurus_10": "Your North Node is in Taurus in the 10th house. This is your life purpose, your soul mission. You're here to learn grounded, sensual, steady energy through career/public life/legacy. This is what you're growing toward, not where you start.",
    "NorthNode_Taurus_11": "Your North Node is in Taurus in the 11th house. This is your life purpose, your soul mission. You're here to learn grounded, sensual, steady energy through community/friendships/ideals. This is what you're growing toward, not where you start.",
    "NorthNode_Taurus_12": "Your North Node is in Taurus in the 12th house. This is your life purpose, your soul mission. You're here to learn grounded, sensual, steady energy through spirituality/unconscious/solitude. This is what you're growing toward, not where you start.",
    "NorthNode_Gemini_1": "Your North Node is in Gemini in the 1st house. This is your life purpose, your soul mission. You're here to learn curious, quick, versatile energy through self/identity/appearance. This is what you're growing toward, not where you start.",
    "NorthNode_Gemini_2": "Your North Node is in Gemini in the 2nd house. This is your life purpose, your soul mission. You're here to learn curious, quick, versatile energy through money/values/resources. This is what you're growing toward, not where you start.",
    "NorthNode_Gemini_3": "Your North Node is in Gemini in the 3rd house. This is your life purpose, your soul mission. You're here to learn curious, quick, versatile energy through communication/learning/siblings. This is what you're growing toward, not where you start.",
    "NorthNode_Gemini_4": "Your North Node is in Gemini in the 4th house. This is your life purpose, your soul mission. You're here to learn curious, quick, versatile energy through home/family/roots. This is what you're growing toward, not where you start.",
    "NorthNode_Gemini_5": "Your North Node is in Gemini in the 5th house. This is your life purpose, your soul mission. You're here to learn curious, quick, versatile energy through creativity/romance/play. This is what you're growing toward, not where you start.",
    "NorthNode_Gemini_6": "Your North Node is in Gemini in the 6th house. This is your life purpose, your soul mission. You're here to learn curious, quick, versatile energy through work/health/service. This is what you're growing toward, not where you start.",
    "NorthNode_Gemini_7": "Your North Node is in Gemini in the 7th house. This is your life purpose, your soul mission. You're here to learn curious, quick, versatile energy through partnerships/relationships. This is what you're growing toward, not where you start.",
    "NorthNode_Gemini_8": "Your North Node is in Gemini in the 8th house. This is your life purpose, your soul mission. You're here to learn curious, quick, versatile energy through transformation/intimacy/shared resources. This is what you're growing toward, not where you start.",
    "NorthNode_Gemini_9": "Your North Node is in Gemini in the 9th house. This is your life purpose, your soul mission. You're here to learn curious, quick, versatile energy through philosophy/travel/expansion. This is what you're growing toward, not where you start.",
    "NorthNode_Gemini_10": "Your North Node is in Gemini in the 10th house. This is your life purpose, your soul mission. You're here to learn curious, quick, versatile energy through career/public life/legacy. This is what you're growing toward, not where you start.",
    "NorthNode_Gemini_11": "Your North Node is in Gemini in the 11th house. This is your life purpose, your soul mission. You're here to learn curious, quick, versatile energy through community/friendships/ideals. This is what you're growing toward, not where you start.",
    "NorthNode_Gemini_12": "Your North Node is in Gemini in the 12th house. This is your life purpose, your soul mission. You're here to learn curious, quick, versatile energy through spirituality/unconscious/solitude. This is what you're growing toward, not where you start.",
    "NorthNode_Cancer_1": "Your North Node is in Cancer in the 1st house. This is your life purpose, your soul mission. You're here to learn protective, feeling-forward, nurturing energy through self/identity/appearance. This is what you're growing toward, not where you start.",
    "NorthNode_Cancer_2": "Your North Node is in Cancer in the 2nd house. This is your life purpose, your soul mission. You're here to learn protective, feeling-forward, nurturing energy through money/values/resources. This is what you're growing toward, not where you start.",
    "NorthNode_Cancer_3": "Your North Node is in Cancer in the 3rd house. This is your life purpose, your soul mission. You're here to learn protective, feeling-forward, nurturing energy through communication/learning/siblings. This is what you're growing toward, not where you start.",
    "NorthNode_Cancer_4": "Your North Node is in Cancer in the 4th house. This is your life purpose, your soul mission. You're here to learn protective, feeling-forward, nurturing energy through home/family/roots. This is what you're growing toward, not where you start.",
    "NorthNode_Cancer_5": "Your North Node is in Cancer in the 5th house. This is your life purpose, your soul mission. You're here to learn protective, feeling-forward, nurturing energy through creativity/romance/play. This is what you're growing toward, not where you start.",
    "NorthNode_Cancer_6": "Your North Node is in Cancer in the 6th house. This is your life purpose, your soul mission. You're here to learn protective, feeling-forward, nurturing energy through work/health/service. This is what you're growing toward, not where you start.",
    "NorthNode_Cancer_7": "Your North Node is in Cancer in the 7th house. This is your life purpose, your soul mission. You're here to learn protective, feeling-forward, nurturing energy through partnerships/relationships. This is what you're growing toward, not where you start.",
    "NorthNode_Cancer_8": "Your North Node is in Cancer in the 8th house. This is your life purpose, your soul mission. You're here to learn protective, feeling-forward, nurturing energy through transformation/intimacy/shared resources. This is what you're growing toward, not where you start.",
    "NorthNode_Cancer_9": "Your North Node is in Cancer in the 9th house. This is your life purpose, your soul mission. You're here to learn protective, feeling-forward, nurturing energy through philosophy/travel/expansion. This is what you're growing toward, not where you start.",
    "NorthNode_Cancer_10": "Your North Node is in Cancer in the 10th house. This is your life purpose, your soul mission. You're here to learn protective, feeling-forward, nurturing energy through career/public life/legacy. This is what you're growing toward, not where you start.",
    "NorthNode_Cancer_11": "Your North Node is in Cancer in the 11th house. This is your life purpose, your soul mission. You're here to learn protective, feeling-forward, nurturing energy through community/friendships/ideals. This is what you're growing toward, not where you start.",
    "NorthNode_Cancer_12": "Your North Node is in Cancer in the 12th house. This is your life purpose, your soul mission. You're here to learn protective, feeling-forward, nurturing energy through spirituality/unconscious/solitude. This is what you're growing toward, not where you start.",
    "NorthNode_Leo_1": "Your North Node is in Leo in the 1st house. This is your life purpose, your soul mission. You're here to learn expressive, heart-led, magnetic energy through self/identity/appearance. This is what you're growing toward, not where you start.",
    "NorthNode_Leo_2": "Your North Node is in Leo in the 2nd house. This is your life purpose, your soul mission. You're here to learn expressive, heart-led, magnetic energy through money/values/resources. This is what you're growing toward, not where you start.",
    "NorthNode_Leo_3": "Your North Node is in Leo in the 3rd house. This is your life purpose, your soul mission. You're here to learn expressive, heart-led, magnetic energy through communication/learning/siblings. This is what you're growing toward, not where you start.",
    "NorthNode_Leo_4": "Your North Node is in Leo in the 4th house. This is your life purpose, your soul mission. You're here to learn expressive, heart-led, magnetic energy through home/family/roots. This is what you're growing toward, not where you start.",
    "NorthNode_Leo_5": "Your North Node is in Leo in the 5th house. This is your life purpose, your soul mission. You're here to learn expressive, heart-led, magnetic energy through creativity/romance/play. This is what you're growing toward, not where you start.",
    "NorthNode_Leo_6": "Your North Node is in Leo in the 6th house. This is your life purpose, your soul mission. You're here to learn expressive, heart-led, magnetic energy through work/health/service. This is what you're growing toward, not where you start.",
    "NorthNode_Leo_7": "Your North Node is in Leo in the 7th house. This is your life purpose, your soul mission. You're here to learn expressive, heart-led, magnetic energy through partnerships/relationships. This is what you're growing toward, not where you start.",
    "NorthNode_Leo_8": "Your North Node is in Leo in the 8th house. This is your life purpose, your soul mission. You're here to learn expressive, heart-led, magnetic energy through transformation/intimacy/shared resources. This is what you're growing toward, not where you start.",
    "NorthNode_Leo_9": "Your North Node is in Leo in the 9th house. This is your life purpose, your soul mission. You're here to learn expressive, heart-led, magnetic energy through philosophy/travel/expansion. This is what you're growing toward, not where you start.",
    "NorthNode_Leo_10": "Your North Node is in Leo in the 10th house. This is your life purpose, your soul mission. You're here to learn expressive, heart-led, magnetic energy through career/public life/legacy. This is what you're growing toward, not where you start.",
    "NorthNode_Leo_11": "Your North Node is in Leo in the 11th house. This is your life purpose, your soul mission. You're here to learn expressive, heart-led, magnetic energy through community/friendships/ideals. This is what you're growing toward, not where you start.",
    "NorthNode_Leo_12": "Your North Node is in Leo in the 12th house. This is your life purpose, your soul mission. You're here to learn expressive, heart-led, magnetic energy through spirituality/unconscious/solitude. This is what you're growing toward, not where you start.",
    "NorthNode_Virgo_1": "Your North Node is in Virgo in the 1st house. This is your life purpose, your soul mission. You're here to learn discerning, service-focused, precise energy through self/identity/appearance. This is what you're growing toward, not where you start.",
    "NorthNode_Virgo_2": "Your North Node is in Virgo in the 2nd house. This is your life purpose, your soul mission. You're here to learn discerning, service-focused, precise energy through money/values/resources. This is what you're growing toward, not where you start.",
    "NorthNode_Virgo_3": "Your North Node is in Virgo in the 3rd house. This is your life purpose, your soul mission. You're here to learn discerning, service-focused, precise energy through communication/learning/siblings. This is what you're growing toward, not where you start.",
    "NorthNode_Virgo_4": "Your North Node is in Virgo in the 4th house. This is your life purpose, your soul mission. You're here to learn discerning, service-focused, precise energy through home/family/roots. This is what you're growing toward, not where you start.",
    "NorthNode_Virgo_5": "Your North Node is in Virgo in the 5th house. This is your life purpose, your soul mission. You're here to learn discerning, service-focused, precise energy through creativity/romance/play. This is what you're growing toward, not where you start.",
    "NorthNode_Virgo_6": "Your North Node is in Virgo in the 6th house. This is your life purpose, your soul mission. You're here to learn discerning, service-focused, precise energy through work/health/service. This is what you're growing toward, not where you start.",
    "NorthNode_Virgo_7": "Your North Node is in Virgo in the 7th house. This is your life purpose, your soul mission. You're here to learn discerning, service-focused, precise energy through partnerships/relationships. This is what you're growing toward, not where you start.",
    "NorthNode_Virgo_8": "Your North Node is in Virgo in the 8th house. This is your life purpose, your soul mission. You're here to learn discerning, service-focused, precise energy through transformation/intimacy/shared resources. This is what you're growing toward, not where you start.",
    "NorthNode_Virgo_9": "Your North Node is in Virgo in the 9th house. This is your life purpose, your soul mission. You're here to learn discerning, service-focused, precise energy through philosophy/travel/expansion. This is what you're growing toward, not where you start.",
    "NorthNode_Virgo_10": "Your North Node is in Virgo in the 10th house. This is your life purpose, your soul mission. You're here to learn discerning, service-focused, precise energy through career/public life/legacy. This is what you're growing toward, not where you start.",
    "NorthNode_Virgo_11": "Your North Node is in Virgo in the 11th house. This is your life purpose, your soul mission. You're here to learn discerning, service-focused, precise energy through community/friendships/ideals. This is what you're growing toward, not where you start.",
    "NorthNode_Virgo_12": "Your North Node is in Virgo in the 12th house. This is your life purpose, your soul mission. You're here to learn discerning, service-focused, precise energy through spirituality/unconscious/solitude. This is what you're growing toward, not where you start.",
    "NorthNode_Libra_1": "Your North Node is in Libra in the 1st house. This is your life purpose, your soul mission. You're here to learn harmonizing, relational, diplomatic energy through self/identity/appearance. This is what you're growing toward, not where you start.",
    "NorthNode_Libra_2": "Your North Node is in Libra in the 2nd house. This is your life purpose, your soul mission. You're here to learn harmonizing, relational, diplomatic energy through money/values/resources. This is what you're growing toward, not where you start.",
    "NorthNode_Libra_3": "Your North Node is in Libra in the 3rd house. This is your life purpose, your soul mission. You're here to learn harmonizing, relational, diplomatic energy through communication/learning/siblings. This is what you're growing toward, not where you start.",
    "NorthNode_Libra_4": "Your North Node is in Libra in the 4th house. This is your life purpose, your soul mission. You're here to learn harmonizing, relational, diplomatic energy through home/family/roots. This is what you're growing toward, not where you start.",
    "NorthNode_Libra_5": "Your North Node is in Libra in the 5th house. This is your life purpose, your soul mission. You're here to learn harmonizing, relational, diplomatic energy through creativity/romance/play. This is what you're growing toward, not where you start.",
    "NorthNode_Libra_6": "Your North Node is in Libra in the 6th house. This is your life purpose, your soul mission. You're here to learn harmonizing, relational, diplomatic energy through work/health/service. This is what you're growing toward, not where you start.",
    "NorthNode_Libra_7": "Your North Node is in Libra in the 7th house. This is your life purpose, your soul mission. You're here to learn harmonizing, relational, diplomatic energy through partnerships/relationships. This is what you're growing toward, not where you start.",
    "NorthNode_Libra_8": "Your North Node is in Libra in the 8th house. This is your life purpose, your soul mission. You're here to learn harmonizing, relational, diplomatic energy through transformation/intimacy/shared resources. This is what you're growing toward, not where you start.",
    "NorthNode_Libra_9": "Your North Node is in Libra in the 9th house. This is your life purpose, your soul mission. You're here to learn harmonizing, relational, diplomatic energy through philosophy/travel/expansion. This is what you're growing toward, not where you start.",
    "NorthNode_Libra_10": "Your North Node is in Libra in the 10th house. This is your life purpose, your soul mission. You're here to learn harmonizing, relational, diplomatic energy through career/public life/legacy. This is what you're growing toward, not where you start.",
    "NorthNode_Libra_11": "Your North Node is in Libra in the 11th house. This is your life purpose, your soul mission. You're here to learn harmonizing, relational, diplomatic energy through community/friendships/ideals. This is what you're growing toward, not where you start.",
    "NorthNode_Libra_12": "Your North Node is in Libra in the 12th house. This is your life purpose, your soul mission. You're here to learn harmonizing, relational, diplomatic energy through spirituality/unconscious/solitude. This is what you're growing toward, not where you start.",
    "NorthNode_Scorpio_1": "Your North Node is in Scorpio in the 1st house. This is your life purpose, your soul mission. You're here to learn intense, investigative, all-or-nothing energy through self/identity/appearance. This is what you're growing toward, not where you start.",
    "NorthNode_Scorpio_2": "Your North Node is in Scorpio in the 2nd house. This is your life purpose, your soul mission. You're here to learn intense, investigative, all-or-nothing energy through money/values/resources. This is what you're growing toward, not where you start.",
    "NorthNode_Scorpio_3": "Your North Node is in Scorpio in the 3rd house. This is your life purpose, your soul mission. You're here to learn intense, investigative, all-or-nothing energy through communication/learning/siblings. This is what you're growing toward, not where you start.",
    "NorthNode_Scorpio_4": "Your North Node is in Scorpio in the 4th house. This is your life purpose, your soul mission. You're here to learn intense, investigative, all-or-nothing energy through home/family/roots. This is what you're growing toward, not where you start.",
    "NorthNode_Scorpio_5": "Your North Node is in Scorpio in the 5th house. This is your life purpose, your soul mission. You're here to learn intense, investigative, all-or-nothing energy through creativity/romance/play. This is what you're growing toward, not where you start.",
    "NorthNode_Scorpio_6": "Your North Node is in Scorpio in the 6th house. This is your life purpose, your soul mission. You're here to learn intense, investigative, all-or-nothing energy through work/health/service. This is what you're growing toward, not where you start.",
    "NorthNode_Scorpio_7": "Your North Node is in Scorpio in the 7th house. This is your life purpose, your soul mission. You're here to learn intense, investigative, all-or-nothing energy through partnerships/relationships. This is what you're growing toward, not where you start.",
    "NorthNode_Scorpio_8": "Your North Node is in Scorpio in the 8th house. This is your life purpose, your soul mission. You're here to learn intense, investigative, all-or-nothing energy through transformation/intimacy/shared resources. This is what you're growing toward, not where you start.",
    "NorthNode_Scorpio_9": "Your North Node is in Scorpio in the 9th house. This is your life purpose, your soul mission. You're here to learn intense, investigative, all-or-nothing energy through philosophy/travel/expansion. This is what you're growing toward, not where you start.",
    "NorthNode_Scorpio_10": "Your North Node is in Scorpio in the 10th house. This is your life purpose, your soul mission. You're here to learn intense, investigative, all-or-nothing energy through career/public life/legacy. This is what you're growing toward, not where you start.",
    "NorthNode_Scorpio_11": "Your North Node is in Scorpio in the 11th house. This is your life purpose, your soul mission. You're here to learn intense, investigative, all-or-nothing energy through community/friendships/ideals. This is what you're growing toward, not where you start.",
    "NorthNode_Scorpio_12": "Your North Node is in Scorpio in the 12th house. This is your life purpose, your soul mission. You're here to learn intense, investigative, all-or-nothing energy through spirituality/unconscious/solitude. This is what you're growing toward, not where you start.",
    "NorthNode_Sagittarius_1": "Your North Node is in Sagittarius in the 1st house. This is your life purpose, your soul mission. You're here to learn truth-seeking, adventurous, optimistic energy through self/identity/appearance. This is what you're growing toward, not where you start.",
    "NorthNode_Sagittarius_2": "Your North Node is in Sagittarius in the 2nd house. This is your life purpose, your soul mission. You're here to learn truth-seeking, adventurous, optimistic energy through money/values/resources. This is what you're growing toward, not where you start.",
    "NorthNode_Sagittarius_3": "Your North Node is in Sagittarius in the 3rd house. This is your life purpose, your soul mission. You're here to learn truth-seeking, adventurous, optimistic energy through communication/learning/siblings. This is what you're growing toward, not where you start.",
    "NorthNode_Sagittarius_4": "Your North Node is in Sagittarius in the 4th house. This is your life purpose, your soul mission. You're here to learn truth-seeking, adventurous, optimistic energy through home/family/roots. This is what you're growing toward, not where you start.",
    "NorthNode_Sagittarius_5": "Your North Node is in Sagittarius in the 5th house. This is your life purpose, your soul mission. You're here to learn truth-seeking, adventurous, optimistic energy through creativity/romance/play. This is what you're growing toward, not where you start.",
    "NorthNode_Sagittarius_6": "Your North Node is in Sagittarius in the 6th house. This is your life purpose, your soul mission. You're here to learn truth-seeking, adventurous, optimistic energy through work/health/service. This is what you're growing toward, not where you start.",
    "NorthNode_Sagittarius_7": "Your North Node is in Sagittarius in the 7th house. This is your life purpose, your soul mission. You're here to learn truth-seeking, adventurous, optimistic energy through partnerships/relationships. This is what you're growing toward, not where you start.",
    "NorthNode_Sagittarius_8": "Your North Node is in Sagittarius in the 8th house. This is your life purpose, your soul mission. You're here to learn truth-seeking, adventurous, optimistic energy through transformation/intimacy/shared resources. This is what you're growing toward, not where you start.",
    "NorthNode_Sagittarius_9": "Your North Node is in Sagittarius in the 9th house. This is your life purpose, your soul mission. You're here to learn truth-seeking, adventurous, optimistic energy through philosophy/travel/expansion. This is what you're growing toward, not where you start.",
    "NorthNode_Sagittarius_10": "Your North Node is in Sagittarius in the 10th house. This is your life purpose, your soul mission. You're here to learn truth-seeking, adventurous, optimistic energy through career/public life/legacy. This is what you're growing toward, not where you start.",
    "NorthNode_Sagittarius_11": "Your North Node is in Sagittarius in the 11th house. This is your life purpose, your soul mission. You're here to learn truth-seeking, adventurous, optimistic energy through community/friendships/ideals. This is what you're growing toward, not where you start.",
    "NorthNode_Sagittarius_12": "Your North Node is in Sagittarius in the 12th house. This is your life purpose, your soul mission. You're here to learn truth-seeking, adventurous, optimistic energy through spirituality/unconscious/solitude. This is what you're growing toward, not where you start.",
    "NorthNode_Capricorn_1": "Your North Node is in Capricorn in the 1st house. This is your life purpose, your soul mission. You're here to learn strategic, disciplined, legacy-minded energy through self/identity/appearance. This is what you're growing toward, not where you start.",
    "NorthNode_Capricorn_2": "Your North Node is in Capricorn in the 2nd house. This is your life purpose, your soul mission. You're here to learn strategic, disciplined, legacy-minded energy through money/values/resources. This is what you're growing toward, not where you start.",
    "NorthNode_Capricorn_3": "Your North Node is in Capricorn in the 3rd house. This is your life purpose, your soul mission. You're here to learn strategic, disciplined, legacy-minded energy through communication/learning/siblings. This is what you're growing toward, not where you start.",
    "NorthNode_Capricorn_4": "Your North Node is in Capricorn in the 4th house. This is your life purpose, your soul mission. You're here to learn strategic, disciplined, legacy-minded energy through home/family/roots. This is what you're growing toward, not where you start.",
    "NorthNode_Capricorn_5": "Your North Node is in Capricorn in the 5th house. This is your life purpose, your soul mission. You're here to learn strategic, disciplined, legacy-minded energy through creativity/romance/play. This is what you're growing toward, not where you start.",
    "NorthNode_Capricorn_6": "Your North Node is in Capricorn in the 6th house. This is your life purpose, your soul mission. You're here to learn strategic, disciplined, legacy-minded energy through work/health/service. This is what you're growing toward, not where you start.",
    "NorthNode_Capricorn_7": "Your North Node is in Capricorn in the 7th house. This is your life purpose, your soul mission. You're here to learn strategic, disciplined, legacy-minded energy through partnerships/relationships. This is what you're growing toward, not where you start.",
    "NorthNode_Capricorn_8": "Your North Node is in Capricorn in the 8th house. This is your life purpose, your soul mission. You're here to learn strategic, disciplined, legacy-minded energy through transformation/intimacy/shared resources. This is what you're growing toward, not where you start.",
    "NorthNode_Capricorn_9": "Your North Node is in Capricorn in the 9th house. This is your life purpose, your soul mission. You're here to learn strategic, disciplined, legacy-minded energy through philosophy/travel/expansion. This is what you're growing toward, not where you start.",
    "NorthNode_Capricorn_10": "Your North Node is in Capricorn in the 10th house. This is your life purpose, your soul mission. You're here to learn strategic, disciplined, legacy-minded energy through career/public life/legacy. This is what you're growing toward, not where you start.",
    "NorthNode_Capricorn_11": "Your North Node is in Capricorn in the 11th house. This is your life purpose, your soul mission. You're here to learn strategic, disciplined, legacy-minded energy through community/friendships/ideals. This is what you're growing toward, not where you start.",
    "NorthNode_Capricorn_12": "Your North Node is in Capricorn in the 12th house. This is your life purpose, your soul mission. You're here to learn strategic, disciplined, legacy-minded energy through spirituality/unconscious/solitude. This is what you're growing toward, not where you start.",
    "NorthNode_Aquarius_1": "Your North Node is in Aquarius in the 1st house. This is your life purpose, your soul mission. You're here to learn visionary, future-focused, unconventional energy through self/identity/appearance. This is what you're growing toward, not where you start.",
    "NorthNode_Aquarius_2": "Your North Node is in Aquarius in the 2nd house. This is your life purpose, your soul mission. You're here to learn visionary, future-focused, unconventional energy through money/values/resources. This is what you're growing toward, not where you start.",
    "NorthNode_Aquarius_3": "Your North Node is in Aquarius in the 3rd house. This is your life purpose, your soul mission. You're here to learn visionary, future-focused, unconventional energy through communication/learning/siblings. This is what you're growing toward, not where you start.",
    "NorthNode_Aquarius_4": "Your North Node is in Aquarius in the 4th house. This is your life purpose, your soul mission. You're here to learn visionary, future-focused, unconventional energy through home/family/roots. This is what you're growing toward, not where you start.",
    "NorthNode_Aquarius_5": "Your North Node is in Aquarius in the 5th house. This is your life purpose, your soul mission. You're here to learn visionary, future-focused, unconventional energy through creativity/romance/play. This is what you're growing toward, not where you start.",
    "NorthNode_Aquarius_6": "Your North Node is in Aquarius in the 6th house. This is your life purpose, your soul mission. You're here to learn visionary, future-focused, unconventional energy through work/health/service. This is what you're growing toward, not where you start.",
    "NorthNode_Aquarius_7": "Your North Node is in Aquarius in the 7th house. This is your life purpose, your soul mission. You're here to learn visionary, future-focused, unconventional energy through partnerships/relationships. This is what you're growing toward, not where you start.",
    "NorthNode_Aquarius_8": "Your North Node is in Aquarius in the 8th house. This is your life purpose, your soul mission. You're here to learn visionary, future-focused, unconventional energy through transformation/intimacy/shared resources. This is what you're growing toward, not where you start.",
    "NorthNode_Aquarius_9": "Your North Node is in Aquarius in the 9th house. This is your life purpose, your soul mission. You're here to learn visionary, future-focused, unconventional energy through philosophy/travel/expansion. This is what you're growing toward, not where you start.",
    "NorthNode_Aquarius_10": "Your North Node is in Aquarius in the 10th house. This is your life purpose, your soul mission. You're here to learn visionary, future-focused, unconventional energy through career/public life/legacy. This is what you're growing toward, not where you start.",
    "NorthNode_Aquarius_11": "Your North Node is in Aquarius in the 11th house. This is your life purpose, your soul mission. You're here to learn visionary, future-focused, unconventional energy through community/friendships/ideals. This is what you're growing toward, not where you start.",
    "NorthNode_Aquarius_12": "Your North Node is in Aquarius in the 12th house. This is your life purpose, your soul mission. You're here to learn visionary, future-focused, unconventional energy through spirituality/unconscious/solitude. This is what you're growing toward, not where you start.",
    "NorthNode_Pisces_1": "Your North Node is in Pisces in the 1st house. This is your life purpose, your soul mission. You're here to learn sensitive, poetic, compassionate energy through self/identity/appearance. This is what you're growing toward, not where you start.",
    "NorthNode_Pisces_2": "Your North Node is in Pisces in the 2nd house. This is your life purpose, your soul mission. You're here to learn sensitive, poetic, compassionate energy through money/values/resources. This is what you're growing toward, not where you start.",
    "NorthNode_Pisces_3": "Your North Node is in Pisces in the 3rd house. This is your life purpose, your soul mission. You're here to learn sensitive, poetic, compassionate energy through communication/learning/siblings. This is what you're growing toward, not where you start.",
    "NorthNode_Pisces_4": "Your North Node is in Pisces in the 4th house. This is your life purpose, your soul mission. You're here to learn sensitive, poetic, compassionate energy through home/family/roots. This is what you're growing toward, not where you start.",
    "NorthNode_Pisces_5": "Your North Node is in Pisces in the 5th house. This is your life purpose, your soul mission. You're here to learn sensitive, poetic, compassionate energy through creativity/romance/play. This is what you're growing toward, not where you start.",
    "NorthNode_Pisces_6": "Your North Node is in Pisces in the 6th house. This is your life purpose, your soul mission. You're here to learn sensitive, poetic, compassionate energy through work/health/service. This is what you're growing toward, not where you start.",
    "NorthNode_Pisces_7": "Your North Node is in Pisces in the 7th house. This is your life purpose, your soul mission. You're here to learn sensitive, poetic, compassionate energy through partnerships/relationships. This is what you're growing toward, not where you start.",
    "NorthNode_Pisces_8": "Your North Node is in Pisces in the 8th house. This is your life purpose, your soul mission. You're here to learn sensitive, poetic, compassionate energy through transformation/intimacy/shared resources. This is what you're growing toward, not where you start.",
    "NorthNode_Pisces_9": "Your North Node is in Pisces in the 9th house. This is your life purpose, your soul mission. You're here to learn sensitive, poetic, compassionate energy through philosophy/travel/expansion. This is what you're growing toward, not where you start.",
    "NorthNode_Pisces_10": "Your North Node is in Pisces in the 10th house. This is your life purpose, your soul mission. You're here to learn sensitive, poetic, compassionate energy through career/public life/legacy. This is what you're growing toward, not where you start.",
    "NorthNode_Pisces_11": "Your North Node is in Pisces in the 11th house. This is your life purpose, your soul mission. You're here to learn sensitive, poetic, compassionate energy through community/friendships/ideals. This is what you're growing toward, not where you start.",
    "NorthNode_Pisces_12": "Your North Node is in Pisces in the 12th house. This is your life purpose, your soul mission. You're here to learn sensitive, poetic, compassionate energy through spirituality/unconscious/solitude. This is what you're growing toward, not where you start."
  },
  "chiron": {
    "Chiron_Aries_1": "Your Chiron is in Aries in the 1st house. This is where you're wounded, where you become a healer. The pain in self/identity/appearance around bold, pioneering, instinctive energy becomes your gift to others.",
    "Chiron_Aries_2": "Your Chiron is in Aries in the 2nd house. This is where you're wounded, where you become a healer. The pain in money/values/resources around bold, pioneering, instinctive energy becomes your gift to others.",
    "Chiron_Aries_3": "Your Chiron is in Aries in the 3rd house. This is where you're wounded, where you become a healer. The pain in communication/learning/siblings around bold, pioneering, instinctive energy becomes your gift to others.",
    "Chiron_Aries_4": "Your Chiron is in Aries in the 4th house. This is where you're wounded, where you become a healer. The pain in home/family/roots around bold, pioneering, instinctive energy becomes your gift to others.",
    "Chiron_Aries_5": "Your Chiron is in Aries in the 5th house. This is where you're wounded, where you become a healer. The pain in creativity/romance/play around bold, pioneering, instinctive energy becomes your gift to others.",
    "Chiron_Aries_6": "Your Chiron is in Aries in the 6th house. This is where you're wounded, where you become a healer. The pain in work/health/service around bold, pioneering, instinctive energy becomes your gift to others.",
    "Chiron_Aries_7": "Your Chiron is in Aries in the 7th house. This is where you're wounded, where you become a healer. The pain in partnerships/relationships around bold, pioneering, instinctive energy becomes your gift to others.",
    "Chiron_Aries_8": "Your Chiron is in Aries in the 8th house. This is where you're wounded, where you become a healer. The pain in transformation/intimacy/shared resources around bold, pioneering, instinctive energy becomes your gift to others.",
    "Chiron_Aries_9": "Your Chiron is in Aries in the 9th house. This is where you're wounded, where you become a healer. The pain in philosophy/travel/expansion around bold, pioneering, instinctive energy becomes your gift to others.",
    "Chiron_Aries_10": "Your Chiron is in Aries in the 10th house. This is where you're wounded, where you become a healer. The pain in career/public life/legacy around bold, pioneering, instinctive energy becomes your gift to others.",
    "Chiron_Aries_11": "Your Chiron is in Aries in the 11th house. This is where you're wounded, where you become a healer. The pain in community/friendships/ideals around bold, pioneering, instinctive energy becomes your gift to others.",
    "Chiron_Aries_12": "Your Chiron is in Aries in the 12th house. This is where you're wounded, where you become a healer. The pain in spirituality/unconscious/solitude around bold, pioneering, instinctive energy becomes your gift to others.",
    "Chiron_Taurus_1": "Your Chiron is in Taurus in the 1st house. This is where you're wounded, where you become a healer. The pain in self/identity/appearance around grounded, sensual, steady energy becomes your gift to others.",
    "Chiron_Taurus_2": "Your Chiron is in Taurus in the 2nd house. This is where you're wounded, where you become a healer. The pain in money/values/resources around grounded, sensual, steady energy becomes your gift to others.",
    "Chiron_Taurus_3": "Your Chiron is in Taurus in the 3rd house. This is where you're wounded, where you become a healer. The pain in communication/learning/siblings around grounded, sensual, steady energy becomes your gift to others.",
    "Chiron_Taurus_4": "Your Chiron is in Taurus in the 4th house. This is where you're wounded, where you become a healer. The pain in home/family/roots around grounded, sensual, steady energy becomes your gift to others.",
    "Chiron_Taurus_5": "Your Chiron is in Taurus in the 5th house. This is where you're wounded, where you become a healer. The pain in creativity/romance/play around grounded, sensual, steady energy becomes your gift to others.",
    "Chiron_Taurus_6": "Your Chiron is in Taurus in the 6th house. This is where you're wounded, where you become a healer. The pain in work/health/service around grounded, sensual, steady energy becomes your gift to others.",
    "Chiron_Taurus_7": "Your Chiron is in Taurus in the 7th house. This is where you're wounded, where you become a healer. The pain in partnerships/relationships around grounded, sensual, steady energy becomes your gift to others.",
    "Chiron_Taurus_8": "Your Chiron is in Taurus in the 8th house. This is where you're wounded, where you become a healer. The pain in transformation/intimacy/shared resources around grounded, sensual, steady energy becomes your gift to others.",
    "Chiron_Taurus_9": "Your Chiron is in Taurus in the 9th house. This is where you're wounded, where you become a healer. The pain in philosophy/travel/expansion around grounded, sensual, steady energy becomes your gift to others.",
    "Chiron_Taurus_10": "Your Chiron is in Taurus in the 10th house. This is where you're wounded, where you become a healer. The pain in career/public life/legacy around grounded, sensual, steady energy becomes your gift to others.",
    "Chiron_Taurus_11": "Your Chiron is in Taurus in the 11th house. This is where you're wounded, where you become a healer. The pain in community/friendships/ideals around grounded, sensual, steady energy becomes your gift to others.",
    "Chiron_Taurus_12": "Your Chiron is in Taurus in the 12th house. This is where you're wounded, where you become a healer. The pain in spirituality/unconscious/solitude around grounded, sensual, steady energy becomes your gift to others.",
    "Chiron_Gemini_1": "Your Chiron is in Gemini in the 1st house. This is where you're wounded, where you become a healer. The pain in self/identity/appearance around curious, quick, versatile energy becomes your gift to others.",
    "Chiron_Gemini_2": "Your Chiron is in Gemini in the 2nd house. This is where you're wounded, where you become a healer. The pain in money/values/resources around curious, quick, versatile energy becomes your gift to others.",
    "Chiron_Gemini_3": "Your Chiron is in Gemini in the 3rd house. This is where you're wounded, where you become a healer. The pain in communication/learning/siblings around curious, quick, versatile energy becomes your gift to others.",
    "Chiron_Gemini_4": "Your Chiron is in Gemini in the 4th house. This is where you're wounded, where you become a healer. The pain in home/family/roots around curious, quick, versatile energy becomes your gift to others.",
    "Chiron_Gemini_5": "Your Chiron is in Gemini in the 5th house. This is where you're wounded, where you become a healer. The pain in creativity/romance/play around curious, quick, versatile energy becomes your gift to others.",
    "Chiron_Gemini_6": "Your Chiron is in Gemini in the 6th house. This is where you're wounded, where you become a healer. The pain in work/health/service around curious, quick, versatile energy becomes your gift to others.",
    "Chiron_Gemini_7": "Your Chiron is in Gemini in the 7th house. This is where you're wounded, where you become a healer. The pain in partnerships/relationships around curious, quick, versatile energy becomes your gift to others.",
    "Chiron_Gemini_8": "Your Chiron is in Gemini in the 8th house. This is where you're wounded, where you become a healer. The pain in transformation/intimacy/shared resources around curious, quick, versatile energy becomes your gift to others.",
    "Chiron_Gemini_9": "Your Chiron is in Gemini in the 9th house. This is where you're wounded, where you become a healer. The pain in philosophy/travel/expansion around curious, quick, versatile energy becomes your gift to others.",
    "Chiron_Gemini_10": "Your Chiron is in Gemini in the 10th house. This is where you're wounded, where you become a healer. The pain in career/public life/legacy around curious, quick, versatile energy becomes your gift to others.",
    "Chiron_Gemini_11": "Your Chiron is in Gemini in the 11th house. This is where you're wounded, where you become a healer. The pain in community/friendships/ideals around curious, quick, versatile energy becomes your gift to others.",
    "Chiron_Gemini_12": "Your Chiron is in Gemini in the 12th house. This is where you're wounded, where you become a healer. The pain in spirituality/unconscious/solitude around curious, quick, versatile energy becomes your gift to others.",
    "Chiron_Cancer_1": "Your Chiron is in Cancer in the 1st house. This is where you're wounded, where you become a healer. The pain in self/identity/appearance around protective, feeling-forward, nurturing energy becomes your gift to others.",
    "Chiron_Cancer_2": "Your Chiron is in Cancer in the 2nd house. This is where you're wounded, where you become a healer. The pain in money/values/resources around protective, feeling-forward, nurturing energy becomes your gift to others.",
    "Chiron_Cancer_3": "Your Chiron is in Cancer in the 3rd house. This is where you're wounded, where you become a healer. The pain in communication/learning/siblings around protective, feeling-forward, nurturing energy becomes your gift to others.",
    "Chiron_Cancer_4": "Your Chiron is in Cancer in the 4th house. This is where you're wounded, where you become a healer. The pain in home/family/roots around protective, feeling-forward, nurturing energy becomes your gift to others.",
    "Chiron_Cancer_5": "Your Chiron is in Cancer in the 5th house. This is where you're wounded, where you become a healer. The pain in creativity/romance/play around protective, feeling-forward, nurturing energy becomes your gift to others.",
    "Chiron_Cancer_6": "Your Chiron is in Cancer in the 6th house. This is where you're wounded, where you become a healer. The pain in work/health/service around protective, feeling-forward, nurturing energy becomes your gift to others.",
    "Chiron_Cancer_7": "Your Chiron is in Cancer in the 7th house. This is where you're wounded, where you become a healer. The pain in partnerships/relationships around protective, feeling-forward, nurturing energy becomes your gift to others.",
    "Chiron_Cancer_8": "Your Chiron is in Cancer in the 8th house. This is where you're wounded, where you become a healer. The pain in transformation/intimacy/shared resources around protective, feeling-forward, nurturing energy becomes your gift to others.",
    "Chiron_Cancer_9": "Your Chiron is in Cancer in the 9th house. This is where you're wounded, where you become a healer. The pain in philosophy/travel/expansion around protective, feeling-forward, nurturing energy becomes your gift to others.",
    "Chiron_Cancer_10": "Your Chiron is in Cancer in the 10th house. This is where you're wounded, where you become a healer. The pain in career/public life/legacy around protective, feeling-forward, nurturing energy becomes your gift to others.",
    "Chiron_Cancer_11": "Your Chiron is in Cancer in the 11th house. This is where you're wounded, where you become a healer. The pain in community/friendships/ideals around protective, feeling-forward, nurturing energy becomes your gift to others.",
    "Chiron_Cancer_12": "Your Chiron is in Cancer in the 12th house. This is where you're wounded, where you become a healer. The pain in spirituality/unconscious/solitude around protective, feeling-forward, nurturing energy becomes your gift to others.",
    "Chiron_Leo_1": "Your Chiron is in Leo in the 1st house. This is where you're wounded, where you become a healer. The pain in self/identity/appearance around expressive, heart-led, magnetic energy becomes your gift to others.",
    "Chiron_Leo_2": "Your Chiron is in Leo in the 2nd house. This is where you're wounded, where you become a healer. The pain in money/values/resources around expressive, heart-led, magnetic energy becomes your gift to others.",
    "Chiron_Leo_3": "Your Chiron is in Leo in the 3rd house. This is where you're wounded, where you become a healer. The pain in communication/learning/siblings around expressive, heart-led, magnetic energy becomes your gift to others.",
    "Chiron_Leo_4": "Your Chiron is in Leo in the 4th house. This is where you're wounded, where you become a healer. The pain in home/family/roots around expressive, heart-led, magnetic energy becomes your gift to others.",
    "Chiron_Leo_5": "Your Chiron is in Leo in the 5th house. This is where you're wounded, where you become a healer. The pain in creativity/romance/play around expressive, heart-led, magnetic energy becomes your gift to others.",
    "Chiron_Leo_6": "Your Chiron is in Leo in the 6th house. This is where you're wounded, where you become a healer. The pain in work/health/service around expressive, heart-led, magnetic energy becomes your gift to others.",
    "Chiron_Leo_7": "Your Chiron is in Leo in the 7th house. This is where you're wounded, where you become a healer. The pain in partnerships/relationships around expressive, heart-led, magnetic energy becomes your gift to others.",
    "Chiron_Leo_8": "Your Chiron is in Leo in the 8th house. This is where you're wounded, where you become a healer. The pain in transformation/intimacy/shared resources around expressive, heart-led, magnetic energy becomes your gift to others.",
    "Chiron_Leo_9": "Your Chiron is in Leo in the 9th house. This is where you're wounded, where you become a healer. The pain in philosophy/travel/expansion around expressive, heart-led, magnetic energy becomes your gift to others.",
    "Chiron_Leo_10": "Your Chiron is in Leo in the 10th house. This is where you're wounded, where you become a healer. The pain in career/public life/legacy around expressive, heart-led, magnetic energy becomes your gift to others.",
    "Chiron_Leo_11": "Your Chiron is in Leo in the 11th house. This is where you're wounded, where you become a healer. The pain in community/friendships/ideals around expressive, heart-led, magnetic energy becomes your gift to others.",
    "Chiron_Leo_12": "Your Chiron is in Leo in the 12th house. This is where you're wounded, where you become a healer. The pain in spirituality/unconscious/solitude around expressive, heart-led, magnetic energy becomes your gift to others.",
    "Chiron_Virgo_1": "Your Chiron is in Virgo in the 1st house. This is where you're wounded, where you become a healer. The pain in self/identity/appearance around discerning, service-focused, precise energy becomes your gift to others.",
    "Chiron_Virgo_2": "Your Chiron is in Virgo in the 2nd house. This is where you're wounded, where you become a healer. The pain in money/values/resources around discerning, service-focused, precise energy becomes your gift to others.",
    "Chiron_Virgo_3": "Your Chiron is in Virgo in the 3rd house. This is where you're wounded, where you become a healer. The pain in communication/learning/siblings around discerning, service-focused, precise energy becomes your gift to others.",
    "Chiron_Virgo_4": "Your Chiron is in Virgo in the 4th house. This is where you're wounded, where you become a healer. The pain in home/family/roots around discerning, service-focused, precise energy becomes your gift to others.",
    "Chiron_Virgo_5": "Your Chiron is in Virgo in the 5th house. This is where you're wounded, where you become a healer. The pain in creativity/romance/play around discerning, service-focused, precise energy becomes your gift to others.",
    "Chiron_Virgo_6": "Your Chiron is in Virgo in the 6th house. This is where you're wounded, where you become a healer. The pain in work/health/service around discerning, service-focused, precise energy becomes your gift to others.",
    "Chiron_Virgo_7": "Your Chiron is in Virgo in the 7th house. This is where you're wounded, where you become a healer. The pain in partnerships/relationships around discerning, service-focused, precise energy becomes your gift to others.",
    "Chiron_Virgo_8": "Your Chiron is in Virgo in the 8th house. This is where you're wounded, where you become a healer. The pain in transformation/intimacy/shared resources around discerning, service-focused, precise energy becomes your gift to others.",
    "Chiron_Virgo_9": "Your Chiron is in Virgo in the 9th house. This is where you're wounded, where you become a healer. The pain in philosophy/travel/expansion around discerning, service-focused, precise energy becomes your gift to others.",
    "Chiron_Virgo_10": "Your Chiron is in Virgo in the 10th house. This is where you're wounded, where you become a healer. The pain in career/public life/legacy around discerning, service-focused, precise energy becomes your gift to others.",
    "Chiron_Virgo_11": "Your Chiron is in Virgo in the 11th house. This is where you're wounded, where you become a healer. The pain in community/friendships/ideals around discerning, service-focused, precise energy becomes your gift to others.",
    "Chiron_Virgo_12": "Your Chiron is in Virgo in the 12th house. This is where you're wounded, where you become a healer. The pain in spirituality/unconscious/solitude around discerning, service-focused, precise energy becomes your gift to others.",
    "Chiron_Libra_1": "Your Chiron is in Libra in the 1st house. This is where you're wounded, where you become a healer. The pain in self/identity/appearance around harmonizing, relational, diplomatic energy becomes your gift to others.",
    "Chiron_Libra_2": "Your Chiron is in Libra in the 2nd house. This is where you're wounded, where you become a healer. The pain in money/values/resources around harmonizing, relational, diplomatic energy becomes your gift to others.",
    "Chiron_Libra_3": "Your Chiron is in Libra in the 3rd house. This is where you're wounded, where you become a healer. The pain in communication/learning/siblings around harmonizing, relational, diplomatic energy becomes your gift to others.",
    "Chiron_Libra_4": "Your Chiron is in Libra in the 4th house. This is where you're wounded, where you become a healer. The pain in home/family/roots around harmonizing, relational, diplomatic energy becomes your gift to others.",
    "Chiron_Libra_5": "Your Chiron is in Libra in the 5th house. This is where you're wounded, where you become a healer. The pain in creativity/romance/play around harmonizing, relational, diplomatic energy becomes your gift to others.",
    "Chiron_Libra_6": "Your Chiron is in Libra in the 6th house. This is where you're wounded, where you become a healer. The pain in work/health/service around harmonizing, relational, diplomatic energy becomes your gift to others.",
    "Chiron_Libra_7": "Your Chiron is in Libra in the 7th house. This is where you're wounded, where you become a healer. The pain in partnerships/relationships around harmonizing, relational, diplomatic energy becomes your gift to others.",
    "Chiron_Libra_8": "Your Chiron is in Libra in the 8th house. This is where you're wounded, where you become a healer. The pain in transformation/intimacy/shared resources around harmonizing, relational, diplomatic energy becomes your gift to others.",
    "Chiron_Libra_9": "Your Chiron is in Libra in the 9th house. This is where you're wounded, where you become a healer. The pain in philosophy/travel/expansion around harmonizing, relational, diplomatic energy becomes your gift to others.",
    "Chiron_Libra_10": "Your Chiron is in Libra in the 10th house. This is where you're wounded, where you become a healer. The pain in career/public life/legacy around harmonizing, relational, diplomatic energy becomes your gift to others.",
    "Chiron_Libra_11": "Your Chiron is in Libra in the 11th house. This is where you're wounded, where you become a healer. The pain in community/friendships/ideals around harmonizing, relational, diplomatic energy becomes your gift to others.",
    "Chiron_Libra_12": "Your Chiron is in Libra in the 12th house. This is where you're wounded, where you become a healer. The pain in spirituality/unconscious/solitude around harmonizing, relational, diplomatic energy becomes your gift to others.",
    "Chiron_Scorpio_1": "Your Chiron is in Scorpio in the 1st house. This is where you're wounded, where you become a healer. The pain in self/identity/appearance around intense, investigative, all-or-nothing energy becomes your gift to others.",
    "Chiron_Scorpio_2": "Your Chiron is in Scorpio in the 2nd house. This is where you're wounded, where you become a healer. The pain in money/values/resources around intense, investigative, all-or-nothing energy becomes your gift to others.",
    "Chiron_Scorpio_3": "Your Chiron is in Scorpio in the 3rd house. This is where you're wounded, where you become a healer. The pain in communication/learning/siblings around intense, investigative, all-or-nothing energy becomes your gift to others.",
    "Chiron_Scorpio_4": "Your Chiron is in Scorpio in the 4th house. This is where you're wounded, where you become a healer. The pain in home/family/roots around intense, investigative, all-or-nothing energy becomes your gift to others.",
    "Chiron_Scorpio_5": "Your Chiron is in Scorpio in the 5th house. This is where you're wounded, where you become a healer. The pain in creativity/romance/play around intense, investigative, all-or-nothing energy becomes your gift to others.",
    "Chiron_Scorpio_6": "Your Chiron is in Scorpio in the 6th house. This is where you're wounded, where you become a healer. The pain in work/health/service around intense, investigative, all-or-nothing energy becomes your gift to others.",
    "Chiron_Scorpio_7": "Your Chiron is in Scorpio in the 7th house. This is where you're wounded, where you become a healer. The pain in partnerships/relationships around intense, investigative, all-or-nothing energy becomes your gift to others.",
    "Chiron_Scorpio_8": "Your Chiron is in Scorpio in the 8th house. This is where you're wounded, where you become a healer. The pain in transformation/intimacy/shared resources around intense, investigative, all-or-nothing energy becomes your gift to others.",
    "Chiron_Scorpio_9": "Your Chiron is in Scorpio in the 9th house. This is where you're wounded, where you become a healer. The pain in philosophy/travel/expansion around intense, investigative, all-or-nothing energy becomes your gift to others.",
    "Chiron_Scorpio_10": "Your Chiron is in Scorpio in the 10th house. This is where you're wounded, where you become a healer. The pain in career/public life/legacy around intense, investigative, all-or-nothing energy becomes your gift to others.",
    "Chiron_Scorpio_11": "Your Chiron is in Scorpio in the 11th house. This is where you're wounded, where you become a healer. The pain in community/friendships/ideals around intense, investigative, all-or-nothing energy becomes your gift to others.",
    "Chiron_Scorpio_12": "Your Chiron is in Scorpio in the 12th house. This is where you're wounded, where you become a healer. The pain in spirituality/unconscious/solitude around intense, investigative, all-or-nothing energy becomes your gift to others.",
    "Chiron_Sagittarius_1": "Your Chiron is in Sagittarius in the 1st house. This is where you're wounded, where you become a healer. The pain in self/identity/appearance around truth-seeking, adventurous, optimistic energy becomes your gift to others.",
    "Chiron_Sagittarius_2": "Your Chiron is in Sagittarius in the 2nd house. This is where you're wounded, where you become a healer. The pain in money/values/resources around truth-seeking, adventurous, optimistic energy becomes your gift to others.",
    "Chiron_Sagittarius_3": "Your Chiron is in Sagittarius in the 3rd house. This is where you're wounded, where you become a healer. The pain in communication/learning/siblings around truth-seeking, adventurous, optimistic energy becomes your gift to others.",
    "Chiron_Sagittarius_4": "Your Chiron is in Sagittarius in the 4th house. This is where you're wounded, where you become a healer. The pain in home/family/roots around truth-seeking, adventurous, optimistic energy becomes your gift to others.",
    "Chiron_Sagittarius_5": "Your Chiron is in Sagittarius in the 5th house. This is where you're wounded, where you become a healer. The pain in creativity/romance/play around truth-seeking, adventurous, optimistic energy becomes your gift to others.",
    "Chiron_Sagittarius_6": "Your Chiron is in Sagittarius in the 6th house. This is where you're wounded, where you become a healer. The pain in work/health/service around truth-seeking, adventurous, optimistic energy becomes your gift to others.",
    "Chiron_Sagittarius_7": "Your Chiron is in Sagittarius in the 7th house. This is where you're wounded, where you become a healer. The pain in partnerships/relationships around truth-seeking, adventurous, optimistic energy becomes your gift to others.",
    "Chiron_Sagittarius_8": "Your Chiron is in Sagittarius in the 8th house. This is where you're wounded, where you become a healer. The pain in transformation/intimacy/shared resources around truth-seeking, adventurous, optimistic energy becomes your gift to others.",
    "Chiron_Sagittarius_9": "Your Chiron is in Sagittarius in the 9th house. This is where you're wounded, where you become a healer. The pain in philosophy/travel/expansion around truth-seeking, adventurous, optimistic energy becomes your gift to others.",
    "Chiron_Sagittarius_10": "Your Chiron is in Sagittarius in the 10th house. This is where you're wounded, where you become a healer. The pain in career/public life/legacy around truth-seeking, adventurous, optimistic energy becomes your gift to others.",
    "Chiron_Sagittarius_11": "Your Chiron is in Sagittarius in the 11th house. This is where you're wounded, where you become a healer. The pain in community/friendships/ideals around truth-seeking, adventurous, optimistic energy becomes your gift to others.",
    "Chiron_Sagittarius_12": "Your Chiron is in Sagittarius in the 12th house. This is where you're wounded, where you become a healer. The pain in spirituality/unconscious/solitude around truth-seeking, adventurous, optimistic energy becomes your gift to others.",
    "Chiron_Capricorn_1": "Your Chiron is in Capricorn in the 1st house. This is where you're wounded, where you become a healer. The pain in self/identity/appearance around strategic, disciplined, legacy-minded energy becomes your gift to others.",
    "Chiron_Capricorn_2": "Your Chiron is in Capricorn in the 2nd house. This is where you're wounded, where you become a healer. The pain in money/values/resources around strategic, disciplined, legacy-minded energy becomes your gift to others.",
    "Chiron_Capricorn_3": "Your Chiron is in Capricorn in the 3rd house. This is where you're wounded, where you become a healer. The pain in communication/learning/siblings around strategic, disciplined, legacy-minded energy becomes your gift to others.",
    "Chiron_Capricorn_4": "Your Chiron is in Capricorn in the 4th house. This is where you're wounded, where you become a healer. The pain in home/family/roots around strategic, disciplined, legacy-minded energy becomes your gift to others.",
    "Chiron_Capricorn_5": "Your Chiron is in Capricorn in the 5th house. This is where you're wounded, where you become a healer. The pain in creativity/romance/play around strategic, disciplined, legacy-minded energy becomes your gift to others.",
    "Chiron_Capricorn_6": "Your Chiron is in Capricorn in the 6th house. This is where you're wounded, where you become a healer. The pain in work/health/service around strategic, disciplined, legacy-minded energy becomes your gift to others.",
    "Chiron_Capricorn_7": "Your Chiron is in Capricorn in the 7th house. This is where you're wounded, where you become a healer. The pain in partnerships/relationships around strategic, disciplined, legacy-minded energy becomes your gift to others.",
    "Chiron_Capricorn_8": "Your Chiron is in Capricorn in the 8th house. This is where you're wounded, where you become a healer. The pain in transformation/intimacy/shared resources around strategic, disciplined, legacy-minded energy becomes your gift to others.",
    "Chiron_Capricorn_9": "Your Chiron is in Capricorn in the 9th house. This is where you're wounded, where you become a healer. The pain in philosophy/travel/expansion around strategic, disciplined, legacy-minded energy becomes your gift to others.",
    "Chiron_Capricorn_10": "Your Chiron is in Capricorn in the 10th house. This is where you're wounded, where you become a healer. The pain in career/public life/legacy around strategic, disciplined, legacy-minded energy becomes your gift to others.",
    "Chiron_Capricorn_11": "Your Chiron is in Capricorn in the 11th house. This is where you're wounded, where you become a healer. The pain in community/friendships/ideals around strategic, disciplined, legacy-minded energy becomes your gift to others.",
    "Chiron_Capricorn_12": "Your Chiron is in Capricorn in the 12th house. This is where you're wounded, where you become a healer. The pain in spirituality/unconscious/solitude around strategic, disciplined, legacy-minded energy becomes your gift to others.",
    "Chiron_Aquarius_1": "Your Chiron is in Aquarius in the 1st house. This is where you're wounded, where you become a healer. The pain in self/identity/appearance around visionary, future-focused, unconventional energy becomes your gift to others.",
    "Chiron_Aquarius_2": "Your Chiron is in Aquarius in the 2nd house. This is where you're wounded, where you become a healer. The pain in money/values/resources around visionary, future-focused, unconventional energy becomes your gift to others.",
    "Chiron_Aquarius_3": "Your Chiron is in Aquarius in the 3rd house. This is where you're wounded, where you become a healer. The pain in communication/learning/siblings around visionary, future-focused, unconventional energy becomes your gift to others.",
    "Chiron_Aquarius_4": "Your Chiron is in Aquarius in the 4th house. This is where you're wounded, where you become a healer. The pain in home/family/roots around visionary, future-focused, unconventional energy becomes your gift to others.",
    "Chiron_Aquarius_5": "Your Chiron is in Aquarius in the 5th house. This is where you're wounded, where you become a healer. The pain in creativity/romance/play around visionary, future-focused, unconventional energy becomes your gift to others.",
    "Chiron_Aquarius_6": "Your Chiron is in Aquarius in the 6th house. This is where you're wounded, where you become a healer. The pain in work/health/service around visionary, future-focused, unconventional energy becomes your gift to others.",
    "Chiron_Aquarius_7": "Your Chiron is in Aquarius in the 7th house. This is where you're wounded, where you become a healer. The pain in partnerships/relationships around visionary, future-focused, unconventional energy becomes your gift to others.",
    "Chiron_Aquarius_8": "Your Chiron is in Aquarius in the 8th house. This is where you're wounded, where you become a healer. The pain in transformation/intimacy/shared resources around visionary, future-focused, unconventional energy becomes your gift to others.",
    "Chiron_Aquarius_9": "Your Chiron is in Aquarius in the 9th house. This is where you're wounded, where you become a healer. The pain in philosophy/travel/expansion around visionary, future-focused, unconventional energy becomes your gift to others.",
    "Chiron_Aquarius_10": "Your Chiron is in Aquarius in the 10th house. This is where you're wounded, where you become a healer. The pain in career/public life/legacy around visionary, future-focused, unconventional energy becomes your gift to others.",
    "Chiron_Aquarius_11": "Your Chiron is in Aquarius in the 11th house. This is where you're wounded, where you become a healer. The pain in community/friendships/ideals around visionary, future-focused, unconventional energy becomes your gift to others.",
    "Chiron_Aquarius_12": "Your Chiron is in Aquarius in the 12th house. This is where you're wounded, where you become a healer. The pain in spirituality/unconscious/solitude around visionary, future-focused, unconventional energy becomes your gift to others.",
    "Chiron_Pisces_1": "Your Chiron is in Pisces in the 1st house. This is where you're wounded, where you become a healer. The pain in self/identity/appearance around sensitive, poetic, compassionate energy becomes your gift to others.",
    "Chiron_Pisces_2": "Your Chiron is in Pisces in the 2nd house. This is where you're wounded, where you become a healer. The pain in money/values/resources around sensitive, poetic, compassionate energy becomes your gift to others.",
    "Chiron_Pisces_3": "Your Chiron is in Pisces in the 3rd house. This is where you're wounded, where you become a healer. The pain in communication/learning/siblings around sensitive, poetic, compassionate energy becomes your gift to others.",
    "Chiron_Pisces_4": "Your Chiron is in Pisces in the 4th house. This is where you're wounded, where you become a healer. The pain in home/family/roots around sensitive, poetic, compassionate energy becomes your gift to others.",
    "Chiron_Pisces_5": "Your Chiron is in Pisces in the 5th house. This is where you're wounded, where you become a healer. The pain in creativity/romance/play around sensitive, poetic, compassionate energy becomes your gift to others.",
    "Chiron_Pisces_6": "Your Chiron is in Pisces in the 6th house. This is where you're wounded, where you become a healer. The pain in work/health/service around sensitive, poetic, compassionate energy becomes your gift to others.",
    "Chiron_Pisces_7": "Your Chiron is in Pisces in the 7th house. This is where you're wounded, where you become a healer. The pain in partnerships/relationships around sensitive, poetic, compassionate energy becomes your gift to others.",
    "Chiron_Pisces_8": "Your Chiron is in Pisces in the 8th house. This is where you're wounded, where you become a healer. The pain in transformation/intimacy/shared resources around sensitive, poetic, compassionate energy becomes your gift to others.",
    "Chiron_Pisces_9": "Your Chiron is in Pisces in the 9th house. This is where you're wounded, where you become a healer. The pain in philosophy/travel/expansion around sensitive, poetic, compassionate energy becomes your gift to others.",
    "Chiron_Pisces_10": "Your Chiron is in Pisces in the 10th house. This is where you're wounded, where you become a healer. The pain in career/public life/legacy around sensitive, poetic, compassionate energy becomes your gift to others.",
    "Chiron_Pisces_11": "Your Chiron is in Pisces in the 11th house. This is where you're wounded, where you become a healer. The pain in community/friendships/ideals around sensitive, poetic, compassionate energy becomes your gift to others.",
    "Chiron_Pisces_12": "Your Chiron is in Pisces in the 12th house. This is where you're wounded, where you become a healer. The pain in spirituality/unconscious/solitude around sensitive, poetic, compassionate energy becomes your gift to others."
  },
  "aspect_patterns": {
    "yod": "You have a Yod in your chart, a rare configuration that creates a sense of fate and destiny. Two planets sextile each other and both quincunx a third, creating intense pressure and purpose. This feels like you're being pushed toward something specific.",
    "t_square": "You have a T-Square in your chart, three planets forming intense tension that demands resolution. Two squares and an opposition create drive and conflict that you must work through. This creates intense motivation but also constant pressure.",
    "grand_trine": "You have a Grand Trine in your chart, three planets forming three trines in the same element. This creates natural talent and flow, but can lead to complacency. Things come easy, but you might avoid the growth that comes from challenge."
  }
}